{
  "space": {
    "id": "arbitrumfoundation.eth",
    "name": "Arbitrum DAO",
    "about": "The official snapshot space for the Arbitrum DAO",
    "admins": [],
    "symbol": "ARB",
    "voting": {
      "delay": null,
      "period": 604800,
      "quorum": null
    },
    "members": [],
    "network": "42161",
    "moderators": [
      "0xd6ca0daa6115bdf4577f26c9fa88f048d15e3ef9"
    ],
    "strategies": [
      {
        "name": "erc20-votes",
        "params": {
          "symbol": "ARB",
          "address": "0x912CE59144191C1204E64559FE8253a0e49E6548",
          "decimals": 18
        },
        "network": "42161"
      }
    ],
    "followersCount": 323307,
    "proposalsCount": 399
  },
  "fetchedAt": "2025-12-22T04:03:54.899Z",
  "proposals": [
    {
      "id": "0xa06500740b56c647f25bd3edba80bf05b00140afe99d6b0d27c0f1dc93287901",
      "end": 1765495856,
      "body": "# Abstract\nWe propose a program for rewarding active delegates focused solely on their voting record and making public their voting rationale. This is the first of a series of upcoming proposals under the umbrella of a DAO Incentive Program (DIP 2.1).\n\n# Motivation and Rationale\nA delegate is defined as a party with voting power who votes on proposals. It narrowly focuses on voting and aiding sentiment analysis of why a proposal passed (or failed).\n\nWith this in mind, there are three overarching goals that this program is trying to achieve:\n* **Increased active voting power.** The total amount of active voting power is steadily increasing over time.\n* **Reduce voter apathy.** The share of active voting power compared to total delegated voting power is increasing over time.\n* **Sentiment analysis.** Sufficient publicly available information to aid understanding and gain insight on decisions made by the DAO.\n\nThis program can be considered successful if delegates are incentivized to continue participating and new delegates step up to participate in the DAO’s voting system. As well, if a proposal does fail, then the proposer should have the ability to gauge sentiment of various voters across the DAO based on the public feedback they leave on the forum. \n\n# Specification\nThis program is designed to be objective and on a per-proposal basis.\n\n## Eligibility requirements\nAny delegate who has satisfied the following eligibility criteria can receive a payment provided that:\n* **Actionable requirements:**\n   * They cast a vote on a proposal,\n   * They publicly post rationale for how they voted and why (within 5 days of a proposal ending).\n\n* **Prior requirements:**\n   * They have cast votes in at least 75% of all proposals in a given month,\n   * They expressed interest to participate in the program and passed compliance requirements with the OpCo,\n   * They have the minimum voting power (specified in budget),\n   * Sufficient votes (FOR/ABSTAIN/AGAINST) cast that achieves quorum target*,\n   * The proposal follows the process outlined in the Arbitrum Constitution.\n\nAdditionally, delegates must adhere to the [program’s terms and conditions](https://docs.google.com/document/d/1CEQc0o-FSAakgFL8wbTiqzeX-PtC5TBHj0BjonFNftI/edit?usp=sharing) in order to remain eligible. Any proposals related to this program will not be eligible for rewards, to avoid any possible conflicts of interest.\n\n**AGAINST does not typically count towards quorum, but for the purpose of this program, it will be included in the count towards quorum for the purpose of issuing rewards. The intention is to enable delegates to vote according to their preference such that ‘quorum’ is always hit even if not officially.*\n\n## Incentive Budget per Quarter\n|Proposal type|Incentive Budget|Payout Cap|Minimum voting power|\n| --- | --- | --- | --- |\n|On-chain constitutional quorum|15,000 USD|700 USD|200k ARB|\n|On-chain non-constitutional quorum|7,000 USD|500 USD|200k ARB|\n|Off-chain decision making (non-constitutional)|7,000 USD|500 USD|200k ARB|\n|Off-chain election|7,000 USD|500 USD|200k ARB|\n|Off-chain temperature check (non-binding)|5,000 USD|300 USD|200k ARB|\n\n*Table 1: Incentive Budget from November 1st 2025 to January 31st 2026*\n\nEvery quarter (3 months), the OpCo will decide an incentive budget that is paid on a per-proposal basis, with the following information: \n* **Proposal type:** Type of decision voted on by the DAO,\n* **Incentive budget:** Budget allocated to a single proposal,\n* **Payout caps (per proposal):** Maximum incentive grant a delegate can receive from this proposal,\n* **Minimum voting power:** A delegate must have at least this amount voting power at the start of a proposal's voting period and must also maintain an average voting power at or above this threshold throughout the relevant month, to be eligible for rewards.\n\nThe budget is expected to be shared at the start of every quarter and to remain in effect for that quarter. This will provide delegates with predictability on the reward structure while allowing the payout strategies to change over time. For clarity, the proposal’s end date for voting (whether on-chain or off-chain) will be the date used to decide which payout strategy is used. **All payouts will be issued in ARB tokens with a 7-day TWAP.**\n\nTable 1 provides the initial incentive budget that will be adopted if the proposal is passed. An illustration of how the payouts may look for the DIP 1.7 September Cohort and if all voting power was eligible for the program, can be [found here](https://docs.google.com/spreadsheets/d/1sk5DATJ16_4tTBHYkwvwE7yI65sThjHCq8skdzSeFFo/edit?usp=sharing).\n\nRewards are calculated relative to:\n\n* A delegate’s share of total eligible voting power,\n* The portion of the incentive budget remaining at the time of allocation,\n* A payment cap that limits the maximum a single delegate can receive.\n\nThis is designed to ensure the entire incentive budget for a proposal is fully allocated and the rewards are distributed fairly among the delegates.\n\nThe key finding is that the payout cap in the September Cohort effectively redistributes rewards across the delegate set and prevents concentration among those with the highest voting power. This mechanism ensures all participating delegates receive some reward. However, as the total eligible voting power increases to ~300m, the influence of the payout cap becomes less pronounced.\n\nIf we assume, in a given month, there are two temperature check proposals followed by a non-constitutional proposal and constitutional proposal, then the DAO as a collective will spend ~$32k.\n\nBased on the DIP 1.7’s September Cohort data, we estimate the following payments for certain sized delegates:\n* Above 8 million votes will earn ~$1.8k,\n* Above 4 million votes will earn ~$1.6k,\n* Above 1 million votes will earn ~$900.\n\nThe estimates are subject to change based on participation by voting power. As more voting power participates, the rewards will be diluted, and it will be up to the OpCo every quarter to evaluate this data to set a new budget.\n\nThe following metric will be used to track the cost-effectiveness of the program: \n- **Dollar spent per vote cast.** A cost-efficiency metric that measures the total program expenditure divided by the number of votes incentivized. It represents how much funding is required to generate a single vote through the program. \n\nDollar spent per vote, alongside rewards on a per-proposal basis, enables the DAO to explicitly define a collective cost for the passage of a proposal. The program will need to find a balance that sufficiently rewards delegates to keep them engaged, and onboard newcomers, while keeping a keen eye on the collective cost to the DAO for the passage of a proposal.\n\n## Tracking of Rewards\nThe OpCo is responsible for keeping track of all rewards for delegate voting. It should be available on a public spreadsheet. For clarity, all records should be kept on a per calendar month basis, and payouts should be issued shortly after month’s end. If a proposal's voting phase starts in one month and ends in the next, it will count towards the month in which it ends. When payouts are computed, the program manager (who could either be OpCo or another party) should accurately keep track of total accrued rewards and total payouts, to ensure only the difference carries over to the next month.\n\nDelegates must earn at least $100 before a payment is issued. The allocation will carry over to the next calendar month, but it will expire after 3 months if the threshold is not reached. This is simply to avoid sending dust transactions alongside the overhead in doing so.\n\n## Safe-guard Budget\n\nThe OpCo reserves the right to offer **bespoke incentive grant budgets** for specific proposals. For example, if a proposal requires multiple temperature check proposals at the same time (like in the STIP), then all proposals may fall within a single bespoke incentive budget.\n\nThe OpCo may decide not to offer any reward. This should be taken in cases to **prevent potential abuse** such as an avalanche of unnecessary proposals or proposals that are deemed very minor in nature (including canceled proposals). If so, the rationale should be published prior or during the respective proposal’s voting phase.\n\n## Facilitated by the OpCo\nThe Arbitrum OpCo Foundation (“OpCo”) retains the authority to change any aspect of the program and any major change should be published to the DAO.\n\nAdditionally, the OpCo are in charge of hiring (and terminating) a program manager (if they choose to do so) with an appropriate service level agreement. It is expected that the program manager will handle the day-to-day operations, but rely on instructions from the OpCo.\n\nThis program will initially be run by the Arbitrum Foundation, but will be handed over with the OpCo as it ramps up its own resources to run DAO-programs. For clarity, anything that states “OpCo” in this proposal will be handled by the Arbitrum Foundation from the onset.\n\n## Participation Depends on Delegates being Non-Sybil and Human\nThe program’s goal is to activate unique and human delegates who will express their opinion through voting and sharing rationales. The program will exclude platforms that enable non-human activity (i.e., AI agents) or enable token holders who sell their votes for short-term profits. Additionally, no Arbitrum Aligned Entity nor the program manager will be allowed to earn any incentive payouts.\n\n# Budget\n\nThe Delegate Incentive Program [multisig](https://app.safe.global/balances?safe=arb1:0x07e7ef4B87Bb4115f7f507C89c2baC5F3342Cc3c) is holding approximately 7 million ARB. This program, alongside upcoming proposals under the umbrella of a DAO incentive program, will absorb the entire budget.\n\nThe OpCo will use this budget for:\n\n* Payouts related to the program,\n* Program manager compensation,\n* Other miscellaneous costs that arise.\n\nThe program manager’s compensation and scope of work will be announced if and when it is negotiated by the OpCo. This will be periodically reviewed by the OpCo and any changes will be published to the DAO.\n\nWe do not expect miscellaneous costs to be substantial. An initial budget of $50k per year will be allocated. If the costs exceed this budget, then the OpCo’s OAT must approve and notify the DAO.\n\nFinally, a transparency report will be prepared and published every 6 months, to track total spend of any program that falls under the umbrella of a DAO Incentive Program.\n\n# Timeline\nThe intention is for the RAD program to run for 1 year. If the OpCo, based on feedback, deems the program is running well, it may authorise the program to continue operating beyond 1 year. If not, any excess funds will be returned to the DAO Treasury.\n\nThe off-chain proposal was posted on December 4th, 2025. A non-constitutional quorum is required alongside more FOR than AGAINST votes for the proposal to pass. \n\nIf passed, the program will retrospectively take into account any proposals conducted after the 1st November 2025, and issue rewards in a timely manner.",
      "type": "basic",
      "start": 1764891056,
      "state": "closed",
      "title": "Rewarding Active Delegates (RAD) Program",
      "votes": 2554,
      "author": "0xb5B069370Ef24BC67F114e185D185063CE3479f8",
      "quorum": 0,
      "scores": [
        124538974.21813162,
        34156694.747007206,
        73681330.05278178
      ],
      "choices": [
        "For",
        "Against",
        "Abstain"
      ],
      "created": 1764891056,
      "scores_total": 232376999.01792055
    },
    {
      "id": "0x12bad84219d04c54cd72231ad8fe883499e85c14762919a06aaa7a251d64b8da",
      "end": 1764874800,
      "body": "Following the [AGV council reconfirmation](https://forum.arbitrum.foundation/t/2026-agv-council-elections-2-seat-council-nominations-for-reconfirmation/30196) votes for [Tim Chang](https://snapshot.box/#/s:arbitrumfoundation.eth/proposal/0x2253b8cdf0d483adf4dd1e9c4a9f473184a51a0ee3e8e826371c203f376edbc6) (Venture Capital and Investments) and [John Kennedy](https://snapshot.box/#/s:arbitrumfoundation.eth/proposal/0x0a3a7b84c7c01cc0feb8a7fad662cbf1f5aeb1b089b205ce412e2bc01d99c504) (Game Development / Go-To-Market Leader), both of which were approved for the 2026 AGV Council, the Election for the three remaining members of the 2026 AGV Council will run from Thursday, November 27th, until Thursday, December 4th.\n\nSnapshot voting will be under a [shielded weighted](https://blog.shutter.network/permanent-shielded-voting-is-coming-to-snapshot/) voting system, according to the [DAO’s procedures](https://forum.arbitrum.foundation/t/the-arbitrum-daos-procedures/29712), allowing delegates to allocate their voting power among candidates as they see fit.\n\n## **Council Purpose**\n\nThe AGV Council serves as a strategic oversight body that ensures AGV’s investments, grants, and partnerships align with the DAO’s mission to establish Arbitrum as the leading ecosystem for gaming and consumer applications. Council Members should represent diverse expertise across gaming, venture capital, operations, and governance, ensuring a balanced, transparent, and accountable process for capital deployment.\n\n## **Core Competencies**\n\n**In order to maintain a well-rounded Council and avoid role overlap, no more than two individuals with the same Core Competency will be accepted onto the AGV Council:**\n\n- Venture Capital Leader\n- Business Development / Growth Leader\n- Governance & Policy Leader\n- Strategy / Operations Leader\n- Game Development / Go-To-Market Leader\n\nIf three (3) members of the same Core Competency receive the highest votes (including the two reconfirmed seats), the candidate with the lowest votes would not be elected, and the seat would pass to the candidate with the next-highest votes from a different Core Competency.\n\nMore information on the council, its purpose, primary responsibilities, and expected core competencies and qualifications can be found in the [Elections Timeline and Process Overview](https://forum.arbitrum.foundation/t/2026-agv-council-elections-timeline-and-process-overview/30195).\n\n## **Process Overview**\n\nCalls were held earlier on Monday, 24th, and Tuesday, 25th of November for applicants to introduce themselves and advocate for their selection. Both recordings can be found below.\n\nPlease also review the “Candidates Eligible for the Snapshot Voting Stage” section at the end of this post for a list of candidates included in the Snapshot vote, as well as the [2026 AGV Council Elections: Application thread](https://forum.arbitrum.foundation/t/2026-agv-council-elections-application-thread/30204) for more information on the candidates, and the complete [Timeline and Process Overview](https://forum.arbitrum.foundation/t/2026-agv-council-elections-timeline-and-process-overview/30195) for elections.\n\n- [Reconfirmation Q&A - November 13th (Transcript)](https://docs.google.com/document/d/17_7lB5UwN4iM1nBIhjIDhzSQPua42SqdnjRCoVSG3Dg/edit?tab=t.p953qyduouma)\n- [AGV Council Applicants Open Hours - Monday 24th (Recording)](https://drive.google.com/file/d/1eSgjJaA-uQ6A54_67ZPa8DBDTn_q9sPz/view?usp=sharing)\n- [AGV Council](https://docs.google.com/document/d/1wTJiMpzWJnRpPbIB-Vj60WlIZuTsa04_GKxjPGFFjNc/edit?usp=sharing) [Applicants](https://drive.google.com/file/d/1eSgjJaA-uQ6A54_67ZPa8DBDTn_q9sPz/view?usp=sharing) [Open Hours - Monday 24th (Transcript)](https://docs.google.com/document/d/1wTJiMpzWJnRpPbIB-Vj60WlIZuTsa04_GKxjPGFFjNc/edit?usp=sharing)\n- [AGV Council](https://drive.google.com/file/d/1rjc_0OqPh_h3yeFUXsoir9kCXWL4ABGt/view?usp=sharing) [Applicants](https://drive.google.com/file/d/1eSgjJaA-uQ6A54_67ZPa8DBDTn_q9sPz/view?usp=sharing) [Open Hours - Tuesday 25th (Recording)](https://drive.google.com/file/d/1rjc_0OqPh_h3yeFUXsoir9kCXWL4ABGt/view?usp=sharing)\n- [AGV Council](https://docs.google.com/document/d/1euM_wFSAR0-Q1LWWmQK4DNcHTx_uyI3sKEiEJWAIMkM/edit?usp=sharing) [Applicants](https://drive.google.com/file/d/1eSgjJaA-uQ6A54_67ZPa8DBDTn_q9sPz/view?usp=sharing) [Open Hours - Tuesday 25th (Transcript)](https://docs.google.com/document/d/1euM_wFSAR0-Q1LWWmQK4DNcHTx_uyI3sKEiEJWAIMkM/edit?usp=sharing)\n\nWe also remind delegates of the [policy regarding purchasing votes on vote-buying platforms](https://forum.arbitrum.foundation/t/2026-agv-council-elections-timeline-and-process-overview/30195/8?u=arbitrumgaming). If purchased votes are the reason a candidate qualifies for a Council seat, the DAO will need to affirm or reject that outcome through a reconfirmation vote.\n\nAll elected council members must be able to pass a KYC and conflicts of interest screening in order to be eligible as a member of the 2026 AGV Council. Additionally, OpCo will conduct a reference check for all electees to verify the expertise and experience stated in their CVs before making the final decision on electee qualification. If a candidate fails to pass this qualification stage, their seat would pass to the candidate with the next-highest votes, as long as that would not introduce a member with a third matching Core Competency; otherwise, it would pass down to the next-highest votes until a fully eligible council is formed.\n\nContributors who disclose a conflict of interest are not expected to alter their voting in any way. Self-voting is not currently banned outright for the reasons stated in previous DAO-wide [discussions](https://forum.arbitrum.foundation/t/should-the-dao-create-coi-self-voting-policies/26062) and based on sentiment gathered from a subsequent [temperature check](https://snapshot.org/#/arbitrumfoundation.eth/proposal/0xbbec2fbf891d9abb21e8be380f79806519df8294d1d2cdce155d105fd1fed8db).\n\nFor more information, refer to [the DAO’s procedures.](https://forum.arbitrum.foundation/t/the-arbitrum-daos-procedures/29712)\n\n## **Candidates Eligible for the Snapshot Voting Stage**\n\nThe following applicants will be included in the Snapshot vote for AGV 2026 Council elections:\n\n- [Greg Canessa (GregCanessa)](https://forum.arbitrum.foundation/t/2026-agv-council-elections-application-thread/30204/7?u=arbitrumgaming) - Strategy / Operations Leader\n- [JoJo (JoJo)](https://forum.arbitrum.foundation/t/2026-agv-council-elections-application-thread/30204/3?u=arbitrumgaming) - Governance & Policy Leader\n- [David Bolger (DavidBolger)](https://forum.arbitrum.foundation/t/2026-agv-council-elections-application-thread/30204/5?u=arbitrumgaming) - Business Development / Growth Leader\n- [Chris Cameron (GFXlabs / PaperImperium)](https://forum.arbitrum.foundation/t/2026-agv-council-elections-application-thread/30204/2?u=arbitrumgaming) - Governance & Policy Leader\n- [Tekr0x (Tekr0x.eth)](https://forum.arbitrum.foundation/t/2026-agv-council-elections-application-thread/30204/6?u=arbitrumgaming) - Governance & Policy Leader\n- [Coinflipcanada (coinflip)](https://forum.arbitrum.foundation/t/2026-agv-council-elections-application-thread/30204/8?u=arbitrumgaming) - Governance & Policy Leader\n\n## Here are their full profiles:\n\n### [Greg Canessa (GregCanessa)](https://forum.arbitrum.foundation/t/2026-agv-council-elections-application-thread/30204/7?u=arbitrumgaming) - Strategy / Operations Leader\n\n**Core Competency:** Strategy / Operations Leader\n\n**Additional Information**\n\nGM and Creator, Xbox Live Arcade at Microsoft (2000-07): created the first console-based digital games ecosystem in history and delivered a $100M+ business for Microsoft. Wrote business plan, secured funding, staffed team, led product definition, shipped 75+ titles and worked with 90+ developers and publishers. Published 20+ titles under Microsoft Game Studios and developed numerous franchises, including Minecraft.\n\nVice President, Mobile, Activision Blizzard (2011-14): built and ran the mobile division at the world’s #1 video game publisher as GM and head of studios. Shipped award-winning games based on the top-selling Call of Duty and Skylanders franchises, Pitfall!, Wipeout, and more for iOS and Android platforms. Managed three studios, demand generation, user acquisition and partnership marketing, platform partnerships, publishing (in partnership with Flurry) and team of 100+ with P&L responsibility.\n\nProject Director, Battle.net at Blizzard (2009-11): GM and head of product management and development for the next generation of Battle.net, Blizzard’s core AAA game service and social network serving 35M+ users worldwide. Successfully integrated new service into the StarCraft, World of Warcraft, and Diablo franchises. Drove social and community efforts, web presence and branding amongst other efforts.\n\nVice President, Video Game Platforms, PopCap Games (2007-09): GM and commercial leader of PopCap’s non-PC games efforts. Brought PopCap’s top-selling franchises (Plants vs. Zombies, Peggle, Bejeweled, Zuma) to consoles and other platforms. Led product management, brand marketing and partnerships, and drove multiple studio M&A deals at the Series A/B stage. Now a division of Electronic Arts.\n\nSVP Studios & GM, GSN Games (division of Sony) (2014-17): GSN is a leading developer and publisher of social/casual games for various platforms with two top-20 grossing franchises on iOS and Google Play. Greg served as GM and studio head, managing and growing the company’s skill business and evolution, enabling competitive play of the world’s biggest and most popular mobile games for free or real money via a new casual eSports platform. Also managed internal and external development of other free-to-play mobile/social titles. Drove brand/product marketing, demand gen, UA, social/community, PR/comms, BD/partnerships and multiple M&A deals. Managed multiple development studios at various points and staff of 250+ with direct P&L responsibility.\n\nGlobal Director, Strategy & Business Operations, Games, Google (2017-23): Led key strategic, operational, marketing and studio functions for Google’s AAA cloud gaming businesses (consumer and SaaS), working closely with internal and external development partners. Managed product planning & strategy, go-to-market, analytics & insights, promotions, monetization, pricing and more with a global and diverse team. Also drove key initiatives for Identity/Account and Mobile within Google Core at the leadership level.\n\n**Are you involved with any other networks from a governance perspective? If so, please list the DAOs and networks.**\n\nNo\n\n**Do you work for a gaming related company? If yes, please list the company or companies you are employed by and confirm if this company intends on applying for any AGV programs?**\n\nYes, Sequence Platforms Inc., a web3 infrastructure platform built for gaming and other blockchain dapps. No intention to apply for AGV programs during council tenure.\n\n**Please share any relevant links, bios, or publications showcasing your work.**\n\nGreg is an accomplished and passionate executive leader with 30+ years experience in the gaming industry at Xbox/Microsoft, Battle.net/Blizzard, Activision, GSN/Sony, PopCap Games (acquired by EA), Google, and Apple. Today, he serves as President & COO at Sequence, the award-winning development platform for integrating web3 into games.\n\nGreg has spent his career focused on game platforms, publishing and ecosystem creation, and played a key role in the advent and proliferation of gaming innovations including multiplayer gaming, digital distribution, social gaming, matchmaking, cloud gaming, and free-to-play. He views web3 and blockchain as critical technologies that will transform the gaming industry. Some of his accomplishments include:\n\nCreator & GM of Xbox Live Arcade: pioneered the first console-based digital games ecosystem in history, shipped 75+ titles, worked with 90+ developers and publishers, published and developed numerous franchises, including UNO, Bejeweled and Minecraft. Also served in strategy and product development roles on Xbox and Xbox 360.\n\nProject Director of Battle.net: defined and led Blizzard’s core AAA game service and social network serving 35M+ users worldwide, successfully integrating Battle.net into the World of Warcraft, StarCraft, and Diablo franchises.\n\nVice President, Mobile at Activision Blizzard: built and ran the mobile division at the world’s #1 game publisher as GM and head of studios, shipped award-winning games and franchises such as Call of Duty, Skylanders, Pitfall!, and Wipeout; managed three studios, user acquisition, platform partnerships, and publishing.\n\nDeep experience shipping and developing core AAA brands Call of Duty, StarCraft, Diablo, World of Warcraft, Sonic, etc., and indie/casual brands Tetris, Pac-man, Peggle, UNO, etc., with 35+ game credits.\n\nGlobal Director, Strategy & Operations, Games at Google: led key strategic, operational, marketing and studio functions for Google’s AAA cloud gaming business, and drove key initiatives for Identity/Account and Mobile within Google Core at leadership level.\n\nAs a hardcore gamer who’s inspired by new technologies, innovations, and platforms that lower access barriers, drive new and awesome experiences for gamers, and create new business opportunities for developers, Greg believes web3 is the next disruptive technology to revolutionize gaming.\n\nIn his current role as COO & President of Sequence, Greg manages a wide range of operational functions for the company, including finance, accounting, data analytics, operations, strategy, BD, GTM, M&A and marketing. He drives numerous initiatives necessitating cross-functional alignment, goal setting, and decision making in the highly dynamic web3 space. Sequence plays an instrumental role in delivering value to the Arbitrum ecosystem, helping to power key web3 games and support various Arbitrum Orbit chains with the Sequence infrastructure stack.\n\nGreg is also a founding member of the AGV council, where he has been instrumental in helping to set up and support the AGV operating team in a number of different capacities. He has been involved in most operational aspects of the program, providing guidance, expertise and networking contacts to support the partners and GM. Amongst his accomplishments, Greg drove the recruiting process for the AGV GM and founders, helped bootstrap PR/comms and other critical functions, and has brought a games industry operational perspective to both internal AGV operations as well as evaluation of prospective investments and portcos.\n\n**Are you willing to complete appropriate non-disclosure agreements (NDAs), KYC requirements, and other necessary documents?**\n\nYes\n\n**References:**\n\nRick Johanson - Partner at AGV\n\nMichael Chang - GM at AGV\n\nAdditional references available upon request\n\n**Disclosures**\n\nOther than Greg’s current role as a Founding AGV Council member, he holds no other roles with the Arbitrum DAO.\n\n### [JoJo (JoJo)](https://forum.arbitrum.foundation/t/2026-agv-council-elections-application-thread/30204/3?u=arbitrumgaming) - Governance & Policy Leader\n\n**Core Competency:** Governance & Policy Leader\n\n**Additional Information**\n\nProvide specific examples from their experience to support your selection.\n\nI have been involved in the Arbitrum DAO since 2023, moved by the interest of understanding governance and meet stakeholders of the ecosystem while working for several Arbitrum native projects. Since that time, I have been involved in several initiatives:\n\n- as a delegate, being one of the most involved and the second highest contributor after L2Beat [accordingly to the Arbitrum Foundation](https://forum.arbitrum.foundation/t/the-dao-incentive-program-dip-2-0/30080)\n- as an evaluator in [LTIPP](https://www.tally.xyz/gov/arbitrum/proposal/110767177349707239820875764565747830009768307680609166467172874966002003291288?govId=eip155:42161:0x789fC99093B09aD01C34DC7251D0C89ce743e5a4), [STIP.b](https://www.tally.xyz/gov/arbitrum/proposal/46550423530471344392834314743264512919726282073822921510880507756642229672784?govId=eip155:42161:0x789fC99093B09aD01C34DC7251D0C89ce743e5a4), [Stylus](https://www.tally.xyz/gov/arbitrum/proposal/24926593791565028016457688578136747185250074804329950986605484216603582190563?govId=eip155:42161:0x789fC99093B09aD01C34DC7251D0C89ce743e5a4), and Questbook [Season 1](https://snapshot.box/#/s:arbitrumfoundation.eth/proposal/0xfa78979a7afa0b0df5c885ebf3a0d46c3676152c6c95b482ed9e91c2ed2dcca5) and [2](https://www.tally.xyz/gov/arbitrum/proposal/98446466630612736687159241204141593794174501692677162686607521796118942563659?govId=eip155:42161:0x789fC99093B09aD01C34DC7251D0C89ce743e5a4)\n- currently as [Program Manager of the D.A.O. Grant Program](https://forum.arbitrum.foundation/t/arbitrum-d-a-o-grant-program-season-3-official-thread/28753)\n- as member of the [interim council of the GCP (now AGV)](https://forum.arbitrum.foundation/t/gcp-update-thread/24982/2), with krz, BobRossi, limes, and coinflip\n\nWhile it is not required by the application, I would like to briefly explain the reasoning behind my candidacy.\n\nI have supported AGV since its inception, initially as part of the interim council, and later as a delegate joining regular calls with Dan and Rick. Over the last year, this has meant participating in monthly calls with other stakeholders, as well as individual calls, to better understand the fund’s activities and contribute input on DAO-related matters. To be clear, I do not have access to any privileged information. My involvement has been solely in my capacity as a delegate who has followed AGV since its creation and has broader experience navigating governance. My intention has simply been to help where I can.\n\nMy intention in seeking this position is to have both the bandwidth and the formal role to step up further.\n\n- One goal I have is to better understand, from within, whether AGV’s scope could potentially be expanded over time. This stems from the appetite the DAO and some delegates have expressed for investing across multiple verticals, and it effectively complements AGV’s gradual move toward entertainment and the investments currently in the pipeline. While we are not here to analyse market trends, it is fairly easy to see how gamification, prediction markets and the blending of different entertainment industries are already opening opportunities outside the classic videogame rails while remaining closely tied to them. Composability remains the number one keyword in the crypto industry. Creating AGV, the legal entities, understanding the first-of-its-kind perks and issues as a DAO-born fund, was already a substantial step in that direction as well as a huge lift. Several members of AGV already bring relevant venture experience beyond gaming: Dan and Rick have backgrounds in venture, with Rick serving as managing partner of a studio; council member Tim Chang is as well a venture partner at a fund; and Michael Chang, while strongly focused on gaming, has a long track record in leadership and investment roles. All conditions are here to evaluate if this potential, long-term value-add is realistic or not: an internal understanding of whether additional investment lines could fit within the existing framework.Needless to say, my top priority would remain AGV’s current DAO-approved mandate; I do not intend to shift focus to future endeavours at the expense of ongoing work.\n- My second personal goal is about horizontal communication. AGV as an AAE has grown significantly, both in maturity and in the number of people involved. At the same time, there is still room to improve its integration with other ecosystem entities, as well as its internal communication with the DAO and, over time, with external stakeholders. This is not a criticism of the current council which, in my view, has done an excellent job guiding a first-of-its-kind, DAO-created fund through its initial year.\n- As a final target, I would like to help evaluate how the D.A.O. Gaming Domain could be integrated into the fund. The timing and maturity of this initiative align well with AGV’s mandate. AGV is oriented toward grants and investments in games and infrastructure-related projects, while D.A.O. is focused on user acquisition experiments. While this knowledge is shared since there is a strong communication between AGV, OCL and the D.A.O. team, a full integration could be highly valuable and more efficient.\n\n**Are you involved with any other networks from a governance perspective? If so, please list the DAOs and networks.**\n\nNone right now.\n\n**Do you work for a gaming related company? If yes, please list the company or companies you are employed by and confirm if this company intends on applying for any AGV programs?**\n\nNo\n\n**Please share any relevant links, bios, or publications showcasing your work.**\n\n- [Supporting (some of) the needs of builders through grants: a simple analysis of what the DAO could do next:](https://forum.arbitrum.foundation/t/supporting-some-of-the-needs-of-builders-through-grants-a-simple-analysis-of-what-the-dao-could-do-next/21184) this post, almost 2 years old, is about the setup of proper tracks for supporting builders in Arbitrum\n- [Arbitrum Staking Working Group: final recommendation:](https://forum.arbitrum.foundation/t/arb-staking-working-groups-final-recommendation/27651) in this work, prepared at four hands with jameskbh and supervisioning of SeedGOV and Tally, we analysed implication of staking ARB and how it could positively affect governance and voting power\n- [D.A.O. Grant Program Official thread:](https://forum.arbitrum.foundation/t/arbitrum-d-a-o-grant-program-season-3-official-thread/28753) this thread contains all the activity I have coordinate so far as PM of the initiatives. Of all the deliverables produced so far, probably the most important (and the one I am the most proud of) is the [mid-term summary report](https://forum.arbitrum.foundation/t/arbitrum-d-a-o-grant-program-season-3-official-thread/28753/34), analysing the state of Arbitrum from the point of view of the team. You can find the extended version of the report [here](https://drive.google.com/file/d/1wHJNODFZJtNKXCj_jmlyqVPNf8yOtWRe/view?usp=sharing).\n\n**Are you willing to complete appropriate non-disclosure agreements (NDAs), KYC requirements, and other necessary documents?**\n\nYes\n\n**References:**\n\nSinkas (current program manager of OpCo)\n\nGianluca, Ministro (Arbitrum representatives of SeedGov)\n\n**Disclosures**\n\nI am employeed by Blockworks, which is a delegate in Arbitrum DAO as well as other DAOs; I am an advisor for Camelot; I am also the Program Manager of the D.A.O. Grant Program. I am receiving compensation for the latter role from the DAO as per the D.A.O. Grant Program Tally vote, and I have received so far compensation as a contributor enrolled in the DIP Program.\n\n### [David Bolger (DavidBolger)](https://forum.arbitrum.foundation/t/2026-agv-council-elections-application-thread/30204/5?u=arbitrumgaming) - Business Development / Growth Leader\n\n**Core Competency:** Business Development / Growth Leader\n\n**Additional Information**\n\nI am the head of gaming and consumer partnerships at Offchain Labs, having worked with the organisation for 3.5 years. In this time I have represented Offchain Labs in conversations with over 500 gaming & consumer companies. I prospect and help onboard and manage relationships for a significant part of the Arbitrum gaming and consumer ecosystem, which currently consists of over 80 projects and companies.\n\nAs a founding member of the AGV Council, I have a strong, daily working relationship with both the AGV team and the council. A core focus of my tenure has been ensuring a smooth experience for builders engaging with the various entities within the Arbitrum ecosystem. Specifically, I have served as a liaison, facilitating cross-AAE collaboration by connecting the Offchain Labs partnerships team (who field many opportunities) with the AGV investment and grants teams (which handle the investment or grants diligence and contracting). My role on the AGV council has been instrumental in bridging these teams.\n\nPrior to my role at Offchain Labs, I was a principal engineer & business development lead at a computer science firm for 7 years.\n\n**Are you involved with any other networks from a governance perspective? If so, please list the DAOs and networks.**\n\nNo.\n\n**Do you work for a gaming related company? If yes, please list the company or companies you are employed by and confirm if this company intends on applying for any AGV programs?**\n\nI lead gaming partnerships for Offchain Labs, working directly with gaming companies on a daily basis.\n\n**Please share any relevant links, bios, or publications showcasing your work.**\n\n- Arbitrum Gaming Ecosystem Projects ([link](https://portal.arbitrum.io/projects/gaming))\n- Arbitrum Orbit Gaming and Consumer Chains ([link](https://portal.arbitrum.io/chains/ecosystem))\n\n**Are you willing to complete appropriate non-disclosure agreements (NDAs), KYC requirements, and other necessary documents?**\n\nYes\n\n**References**:\n\nSteven Goldfeder (Co-founder and CEO at Offchain Labs)\n\nA.J. Warner (Chief Strategy Officer at Offchain Labs)\n\n**Disclosures**\n\nI am employed by Offchain Labs and have spent the past 3.5 years dedicated to growing the Arbitrum ecosystem in a sustainable manner. I hold no other roles in the Arbitrum DAO other than as a retail $ARB token holder.\n\n### [Chris Cameron (GFXlabs / PaperImperium)](https://forum.arbitrum.foundation/t/2026-agv-council-elections-application-thread/30204/2?u=arbitrumgaming) - Governance & Policy Leader\n\n**Core Competency:** Governance & Policy Leader\n\n**Additional Information**\n\nGFX Labs has served in a variety of DAOs and DAO structures as a delegate over the years: Uniswap, MakerDAO/Sky, Compound, Arbitrum, Optimism, Hop, 0x.\n\nGFX Labs has also served as a service provider to many DAOs and projects, including the Long Term Incentive Pilot Program and the Stable Treasury Endowment Program within Arbitrum.\n\nWe have reviewed hundreds of grants, overseen the allocation and granting of at nine figures of funds, and are retained for due diligence research regularly.\n\n**Are you involved with any other networks from a governance perspective? If so, please list the DAOs and networks.**\n\nFrom time to time, GFX Labs will serve as a service provider to networks. I represent GFX Labs on the Optimism Grants Council for Season 8 (July 31 – December 24, 2025). We have done previous work for zkEVM, Berachain, and (of course) Arbitrum.\n\n**Do you work for a gaming related company? If yes, please list the company or companies you are employed by and confirm if this company intends on applying for any AGV programs?**\n\nGFX Labs previously developed [Etherlands](https://paperclip.xyz/work/etherlands) (sunset in 2022).\n\n**Please share any relevant links, bios, or publications showcasing your work.**\n\nGFX’s relevant work covers many areas, as outlined above, and is largely public facing. As a sample only, please refer to our work on Arbitrum in LTIPP, STEP I, and STEP II.\n\n**Are you willing to complete appropriate non-disclosure agreements (NDAs), KYC requirements, and other necessary documents?**\n\nOf course.\n\n**References:**\n\n- Aavechan Initiative *\n- Kirk Hutchinson (Morpho Labs Growth/Governance)\n- Krzystof Urbański (L2Beat) *\n- Reverie *\n- Frisson (Tally) *\n- Denotes Arbitrum governance participants\n\n**Disclosures**\n\nI have no direct or indirect exposure (as defined as 1% or more of my net worth) to any game creator, publisher, or gaming-sector financial company. I have no family members working for any game creator, publisher, or gaming-sector financial company.\n\nI have no material holdings (as defined as $1000 or more) of any crypto asset other than various stablecoins and network gas tokens.\n\nGFX Labs has, to the best of my knowledge, no exposure or existing relationships with any game creator, publisher, or gaming-sector financial company. Tokens held by GFX Labs are the product of in-kind payment (e.g. ARB) or for work-related purposes (e.g. gas tokens and stablecoins).\n\nGFX Labs, like many delegates, provides services to a variety of DAOs, including grants review, financial diligence and risk assessment, procurement RFP evaluation, smart contract development, and user interface support. We will maintain an updated disclosure list on this forum (either on our delegate communications thread or some other permanent location for all AGV councilors) for 2026 once the term begins.\n\nGFX Labs is a delegate eligible under the current and all proposed Arbitrum delegate incentive plans.\n\n### [Tekr0x (Tekr0x.eth)](https://forum.arbitrum.foundation/t/2026-agv-council-elections-application-thread/30204/6?u=arbitrumgaming) - Governance & Policy Leader\n\n**Core Competency:** Governance & Policy Leader\n\n**Additional Information**\n\nI’ve been an active delegate in the Arbitrum DAO since 2023 and was recognized as one of the top delegates in the past DIP program. I’ve represented the DAO at various events and conferences, where I also gave talks about Arbitrum.\n\nI also helped kick off and co-run a mini-apps program on Farcaster with people from the Arbitrum Foundation and Offchain Labs, which sparked more experimentation and interest in consumer and gaming apps.\n\nOverall, I’m a well-informed and well-connected delegate with a strong understanding of the DAO’s structure, dynamics, and AAEs.\n\nOver the last six months, I’ve been one of the most active delegates working on AGV-related efforts and the broader gaming sector. I’ve kept the DAO updated on gaming trends, Arbitrum-native games, and all AGV activities.\n\nI introduced the idea of hosting playtests with AGV portfolio projects and took the lead on organizing and coordinating those sessions. I’ve also shared regular gaming-sector updates across the forum and Telegram while staying active in AGV project communities through their Telegram groups, Discord servers, and other channels.\n\n**Are you involved with any other networks from a governance perspective? If so, please list the DAOs and networks.**\n\nNo.\n\n**Do you work for a gaming related company? If yes, please list the company or companies you are employed by and confirm if this company intends on applying for any AGV programs?**\n\nNo.\n\n**Please share any relevant links, bios, or publications showcasing your work.**\n\n- Gaming on Arbitrum - research post: [Gaming on Arbitrum - A Guide for DAO Members](https://forum.arbitrum.foundation/t/gaming-on-arbitrum-a-guide-for-dao-members/29312)\n- Playtest with AGV portfolio companies: [Wildcard](https://forum.arbitrum.foundation/t/welcome-to-the-next-level-a-new-playtest-series-for-the-dao-featuring-wildcard/29525), [Golden Tides](https://forum.arbitrum.foundation/t/agv-invites-you-to-the-next-level-golden-tides-exclusive-playtest-for-the-arbitrum-dao/30109)\n- Mini Apps initiative: [Mini Apps: What are they and why we should take them seriously](https://forum.arbitrum.foundation/t/mini-apps-what-are-they-and-why-we-should-take-them-seriously/29477)\n\nActively participated in all gaming-related topics on the Arbitrum DAO forum: [Profile - Tekr0x.eth - Arbitrum](https://forum.arbitrum.foundation/u/tekr0x.eth/activity/replies)\n\n**Are you willing to complete appropriate non-disclosure agreements (NDAs), KYC requirements, and other necessary documents?**\n\nYes\n\n**References:**\n\nKrzysztof Urbański, L2BEAT\n\nDan Peng, partner at AGV\n\n**Disclosures**\n\nI have no actual or potential conflicts of interest. I have participated as an active delegate in a delegate incentive program (DIP).\n\n### [Coinflipcanada (coinflip)](https://forum.arbitrum.foundation/t/2026-agv-council-elections-application-thread/30204/8?u=arbitrumgaming) - Governance & Policy Leader\n\n**Core Competency:** Governance & Policy Leader\n\nI have the skills and background to also apply under Strategy / Operations Leader or Business Development / Growth Leader, but applying under Governance & Policy Leader reflects the role I’ve contributed most actively to on the current council, and reflects the unique area of insight I bring to the program.\n\nHaving worked through AGV’s establishment phase, I bring not just governance expertise but the specific context of how this program’s governance structures were designed, why certain decisions were made, and where refinement (rather than restructuring) is needed.\n\n**Additional Information**\n\nA long history with this program which provides me unique institutional knowledge and context, including working to ensure that it functions in a manner that is strongly aligned with Arbitrum.\n\nMy involvement spans:\n\n- Initial Development: Worked with other delegates and AAEs (before we actually used to call them that) to stand up a venture vehicle (even if gaming wasn’t necessarily the one I would have liked to see Arbitrum establish first)\n- GCP Interim Transparency Committee: Participated in identifying where the original working group’s desired operational model may not align with what the DAO wanted to see and ensuring both the election process and overall oversight was better positioned leading into the initial election (while honoring commitments from the original Tally proposal)\n- Inaugural GCP Council: Ran for and served on the first GCP Council to ensure the DAO-led process for organizational alignment was maintained\n- Structural Development: Actively participated in structuring the bylaws and delegation of authority, through hiring up the organization including the council working to bring on industry veteran Michael Chang as GM giving us a strong Gaming and Venture core and working to ensure that by the end of this first term the entity is able to be responsive to the DAO (although work still remains to ensure consistency and commitment)\n\nMy effectiveness stems from my ability to focus singularly on Arbitrum DAO’s interests rather than applying general DAO governance frameworks, most of which haven’t been applied to venture. I understand what Arbitrum specifically needs from AGV and how it fits into our broader ecosystem strategy. This provides essential balance to a council otherwise composed primarily of gaming and venture industry professionals who bring critical domain expertise. We need both: strong gaming/venture voices AND strong Arbitrum-aligned voices. My involvement ensures AGV remains focused on its clear role: serving Arbitrum’s ecosystem growth.\n\nI’m running to ensure we don’t lose momentum on the work started. AGV remains hopefully the first of many investment/treasury related initiatives (and entities) that we pursue as we take a more economically driven approach to growing the DAO. We shouldn’t keep reinventing the wheel, making the same mistakes and suffering needless delays. As an active delegate, including as we move into a more AAE-driven direction, I have a unique grasp on the DAO’s goals, programs and stakeholders, letting us cut through the noise, help others get things done and unlock the potential of these DAO-controlled businesses to serve the greater vision of Arbitrum.\n\nSimply having done the job before doesn’t guarantee I can do it best going forward. I think people can realistically say they felt frustrated that AGV wasn’t as responsive on a week-by-week or month-by-month basis to the DAO during the first term. That frustration is understandable.\n\nI chose to prioritize my efforts on advocating for building durable governance systems over quick fixes, advocating for foundations rather than expedient solutions that weren’t long-term sustainable or would cause future disputes, even when that meant slower visible public progress. I worked to ensure the DAO would have strong influence on the program without needing to go to extremes, which meant choosing to work quietly on structure rather than publicly.\n\nThe operating team should be able to execute swiftly on their mandate, but oversight rights can’t be traded away for operational convenience. Effective oversight doesn’t mean micromanagement, it means the team can operate with confidence knowing the guardrails are clear and consistently applied. That’s what enables speed sustainably, but building those systems doesn’t happen overnight and work still remains.\n\nThe fact that AGV has clearly turned the corner in recent months reflects both the strong team assembled and the governance foundation that now enables them to operate effectively. That work positions us to move forward with both clarity and speed.\n\n**Next Term Priorities**\n\nTo be clear, what I’m reflecting below is what I hope to encourage fellow council members to also believe in and give clear guidance to the team for improving the program and its impact on the Arbitrum ecosystem. It is not the job of oversight to do all such things, but to ensure we can convey to the team what we want and be effective in having that happen.\n\n1. **Building Beyond Single-Term Thinking:** Ensure we have clear systems to successfully manage investments that will extend and be monetized over horizons longer than the currently approved program timeline. AGV’s portfolio will outlive any single council term or program authorization—we need governance structures that handle this reality deliberately, not as an afterthought, regardless of what direction the DAO eventually takes with this program.\n2. **Deeper Integration with the Arbitrum Ecosystem:** With AGV now having clear operational leadership, we have an opportunity for cleaner lines of communication across AAEs and deeper collaboration. OpCo’s recent involvement in administering elections shows how AAEs can support each other operationally. AGV can work more closely with the Arbitrum Foundation on grants to streamline decision making and hand off between potential gaming partners, work to seehow we can make our DeFi infrastructure more accessible to gaming chains, like through OCL-led interoperability efforts, or the Defi network Entropy has been reinforcing.\n3. **Creating Replicable Frameworks:** Ensure that AGV becomes an exportable and replicable framework that makes further investment programs feasible if the DAO decides to pursue them, including any revamps of existing treasury initiatives. We shouldn’t keep reinventing the wheel, the governance structures, operational patterns, and oversight mechanisms we’ve built should serve as blueprints, not one-offs.\n4. **Cultural Alignment, Not Just Structural:** Ensuring that AAEs are aligned with the DAO isn’t just structural: it’s cultural. AGV’s team genuinely wants to serve Arbitrum’s growth and have the DAO’s voice heard in strategic decisions. The challenge in the first term wasn’t lack of willingness, but was lack of established pathways for how to do this effectively and a large learning curve to get the program off the ground. My focus is on fostering these communication channels and decision-making patterns so that alignment happens naturally and consistently, not just when formally required. Building this culture takes time and intentional practice, but the foundation and goodwill are there.\n\n**Are you involved with any other networks from a governance perspective? If so, please list the DAOs and networks.**\n\nI am not involved in any competitive DAOs from a governance perspective but am a Core contributor to the GMX DAO, a leading DeFi protocol on Arbitrum and other blockchains.\n\n**Do you work for a gaming related company? If yes, please list the company or companies you are employed by and confirm if this company intends on applying for any AGV programs?**\n\nNo\n\n**Are you willing to complete appropriate non-disclosure agreements (NDAs), KYC requirements, and other necessary documents?**\n\nYes. For reference, KYC and NDAs have already been executed with the GCP Foundation (AGV) as part of my role on the GCP Council, and I’ve respected and honoured such agreements.\n\n**References**\n\nReferences include individuals who have previously directly worked with me on AGV/GCP matters and can speak to the nature of effective oversight of AAEs\n\nAndreea - Arbitrum Foundation\n\nPatrick McCorry - Arbitrum Foundation\n\nAJ Warner - Offchain Labs\n\n**Disclosures**\n\nAs a core contributor to GMX, I actively advocate on behalf of the GMX DAO. The nature of such activity includes involvement in Arbitrum Governance (although that is led by the GMX DAO’s governance committee, which I’m not a member of).\n\nI actively invest within the Crypto space, but with most investments being in DeFi and Infrastructure, there has been no known conflicts to date and I would recuse if one were to arise.\n\nAdditionally, please disclose all active contributor roles and payment streams related to the Arbitrum DAO that the applicant and entities with which they have a professional or financial relationship have and are receiving.\n\nI’m a member of the AGV oversight council, and currently draw compensation from there. I have previously served on various councils, committees and multisigs on behalf of the Arbitrum DAO but draw no current compensation from any such roles.\n\nI’m not currently a participant in the DAO’s Delegate Incentive Program but may or may not participate in the future depending on the nature and obligations of the program.\n\nGMX activities are supported by the Arbitrum DAO through programs including DRIP (user liquidity incentives distributed by the Arbitrum DAO directly to users), and the Audit Support Program and will likely be supported in the future as GMX remains an active participant in the Arbitrum ecosystem.",
      "type": "weighted",
      "start": 1764270000,
      "state": "closed",
      "title": "AGV - 2026 Council Elections",
      "votes": 1691,
      "author": "0xAbAbE91A907fAdff921720C43ABe4098e7245E99",
      "quorum": 0,
      "scores": [
        40231456.16507834,
        35733809.97682582,
        51711978.47704473,
        26269333.046803836,
        5164052.741809202,
        25185373.01091559
      ],
      "choices": [
        "Greg Canessa",
        "JoJo",
        "David Bolger",
        "Chris Cameron",
        "Tekr0x",
        "Coinflipcanada"
      ],
      "created": 1764262865,
      "scores_total": 184301062.31638572
    },
    {
      "id": "0x0a3a7b84c7c01cc0feb8a7fad662cbf1f5aeb1b089b205ce412e2bc01d99c504",
      "end": 1764244583,
      "body": "# Summary\n\nThis proposal seeks DAO approval for John Kennedy, one of the two candidates nominated by the existing council to sit in the 2026 term. As a reminder, the existing AGV Council’s nominations are Tim Chang, with core competency in Venture Capital and Investments, and John Kennedy, with core Competency in Game Development and Go-To-Market Leader\n\n\n# Rationale\n\nBuilding on the governance practice established with AGV and subsequently OpCo, which combined appointed and elected positions, this election proposes a hybrid approach for filling council seats.\n\nEnsuring continuity of institutional knowledge across our oversight, advisory, and investment programs is critical for effective governance. Having experienced DAO representatives who understand our historical context and strategic direction, independent of the operational team hired to lead these initiatives, helps maintain stability during transitions and preserves organizational memory that might otherwise be lost.\n\nTo address this need, the existing AGV council has voted to nominate two candidates for continuity seats, subject to DAO reconfirmation prior to the election, with three additional seats open for a DAO-wide election.\n\n# Council Nomination: John Kennedy\n\nBelow are the extended details of the nominee for reconfirmation:\n\n**Role / Expertise**\n\nGame Development / Go-To-Market Leader\n\n**Bio**\n\nJohn, formerly Head of Product at AWS GameTech, left in 2023 to launch Actual AI—an engineering manager agent for software teams that provides guardrails for AI-powered software development. Actual AI has received venture funding from AlleyCorp, G2C ventures, OrangeDAO, Alchemist Accelerator, and Irregular Expressions.\n\nAt AWS, John successfully pitched the CEO on transforming Amazon’s Lumberyard into a cutting-edge open-source 3D game engine. He secured a team of over 100 top game engine developers to build Open 3D Engine (o3de.org), a modular, extensible, and high-performance 3D engine featuring a new renderer, visual scripting tool, and physics engine. Additionally, John launched and grew several high-revenue AWS services, enabling game developers to seamlessly serve hundreds of millions of players with capabilities for streaming, multiplayer servers, and cloud storage.\n\nAs a Core Partner at Underscore VC, John has advised numerous early-stage startups on product development and go-to-market strategies. His executive experience spans multiple high-growth startups, including Platform.sh and Acquia. John continues to mentor Series A-C startups, sharing his expertise in scaling businesses.\n\nIn 2024, John co-facilitated Arbitrum’s two GovHack events in collaboration with Hack Humanity at EthDenver and EthCC. Each event drew over 200 participants and resulted in the creation of 48 new governance proposals.\n\n**Major AGV Accomplishments**\n\n* Worked with the team extensively on the formation of the investment thesis, bringing deep gaming industry experience and over 20 years of experience building and marketing digital products.\n* Guided the hiring process, including working on the evaluation rubrics, working with the team and recruiter on candidate triage, and interviewing most candidates.\n* Mentored the team on operations, strategy, and growth, including bi-weekly sessions with the leadership team.\n* Deep deal analysis on all deals that passed IC from the gaming and software development perspective.\n* Met with candidate portfolio companies to vet leadership and technical expertise.\n* Established relationships with partners and portfolio companies.\n\n**Why are you interested in serving on the AGV Council again?**\n\n“I’m excited about the 2nd gaming revolution that is coming to Arbitrum. We have now established the groundwork to execute on our thesis of building a vibrant gaming ecosystem of service providers, games, and gamers. I think we can build the Steam of web3 backed by Arbitrum.\n\nIt has been great to see AGV grow and put down roots. We now have the dream team that is going to blow up the industry. Gaming is in dire need of new channels for user acquisition and monetization. We are in the perfect position to take advantage of this need.\n\nI can’t wait to dive in with the team, guiding portfolio companies on their way to success with GTM and operational expertise, building playbooks, and by connecting the AGV team with new partners who can extend our reach in gaming and AI.”\n\n# Timeline\n\nAn Introduction and Q&A Call was held via Google Meet on November 13th at 5pm UTC.\n\nEach nominated candidate will undergo a separate confirmation Snapshot vote on Thursday, November 20th (this post).\n\n# Voting Options\n\nThis proposal will include the following voting options:\n\n* For\n* Against\n* Abstain\n\nShould FOR be the majority preference, and the combined FOR and ABSTAIN votes meet at least 3% of the total votable ARB supply, the respective candidate will be considered reconfirmed to the AGV council for the 2026 term.\n\nIf this nomination is vetoed by the DAO, that seat will then be added to the Election Process, and the nominee will be automatically entered as an applicant for the Election. If a nominee is vetoed and added to the Election, the number of open seats would increase from three (3) to either four (4) or five (5) seats.",
      "type": "basic",
      "start": 1763639783,
      "state": "closed",
      "title": "John Kennedy reconfirmation for AGV council",
      "votes": 1903,
      "author": "0x4F685B29514eed0c9D929386E86D9cd81981118B",
      "quorum": 0,
      "scores": [
        126254156.24275193,
        6965037.28941554,
        53663954.33908016
      ],
      "choices": [
        "For",
        "Against",
        "Abstain"
      ],
      "created": 1763639783,
      "scores_total": 186883147.87124765
    },
    {
      "id": "0x2253b8cdf0d483adf4dd1e9c4a9f473184a51a0ee3e8e826371c203f376edbc6",
      "end": 1764244425,
      "body": "# Summary\n\nThis proposal seeks DAO approval for Tim Chang, one of the two candidates nominated by the existing council to sit in the 2026 term. As a reminder, the existing AGV Council’s nominations are Tim Chang, with core competency in Venture Capital and Investments, and John Kennedy, with core Competency in Game Development and Go-To-Market Leader\n\n# Rationale\n\nBuilding on the governance practice established with AGV and subsequently OpCo, which combined appointed and elected positions, this election proposes a hybrid approach for filling council seats.\n\nEnsuring continuity of institutional knowledge across our oversight, advisory, and investment programs is critical for effective governance. Having experienced DAO representatives who understand our historical context and strategic direction, independent of the operational team hired to lead these initiatives, helps maintain stability during transitions and preserves organizational memory that might otherwise be lost.\n\nTo address this need, the existing AGV council has voted to nominate two candidates for continuity seats, subject to DAO reconfirmation prior to the election, with three additional seats open for a DAO-wide election.\n\n# Council Nomination: Tim Chang\n\nBelow are the extended details of the nominee for reconfirmation:\n\n**Role / Expertise**\n\nVenture Capital Leader\n\n**Bio**\n\nTim previously led consumer technology investments at Mayfield Fund, focusing on next-gen Commerce & Marketplaces, Communities, Health & Wellness, Gaming and Digital Media, and has been named twice to the Forbes Midas List of top 100 VCs in the world for his early-stage investments at the beginning of the social and mobile smartphone gaming eras.\n\nTim has also been named to the AlwaysOn Power Players of top investors, as well as receiving the Special Achievement award from the Gamification Summit for his work in leveraging game design thinking to domains beyond gaming.\n\nTim has led early-stage investments in Grove Collaborative, Tonal Fitness, Fitmob/Classpass, Iridigm Display, Playdom, ngmoco, Basis, AdChina, Moat, and Pillow, creating more than $2.6B in total exit value. His current board seats include Alignable and TRIPP VR.\n\nHe holds an MBA with honors from the Stanford Graduate School of Business and a MSEE/BSEE from the University of Michigan, where he received a departmental scholar fellowship. Tim has also been an active and avid investor in Web3/blockchain since 2014, helping to establish and invest in early crypto hedge funds, as well as advising and supporting multiple web3 gaming startups.\n\nOutside of his passion for venture and startups, Tim is also a proponent of healing and flourishing of Mind, Body and Spirit, and serves on the non-profit boards of California Institute of Integral Studies (CIIS), and Ecoversity, and formerly served on the nonprofit boards of Little Kids Rock, NorthStar.guide, Gray Area Arts and Reimagine Death, as well as advising Transformative Tech Lab, Consciousness Hacking, Building Bridges, Near Future Summit, Edmund Hillary Fellowship, GoldHouse, Berklee School of Music, and other efforts to uplevel Capitalism with greater consciousness, regenerative models and inclusive stakeholding. His impact efforts include supporting MAPS and co-founding Northstar.guide to ethically commercialize psychedelic medicine, and he is dedicated to supporting Men’s Work, greater financial literacy for Women and Girls, ethical design principles for AI and tech products, and regenerative agriculture/Permaculture.\n\nTim is the cofounder of a cutting-edge social wellness members club called The Portal (https://theportal.house) in the San Francisco Bay Area, with additional locations opening soon.\n\n**Major AGV Accomplishments:**\n\n* Guided initial thesis creation and subsequent thesis evolutions.\n* Worked with the team to create infrastructure, including approval processes, IC review rituals, memo templating, risk management parameters, best practices, due diligence checklist, as well as how to assess behind-the-scenes deal, team and investor syndicate dynamics.\n* Acted as a source of additional context, given his large VC/founder network for deals with known founders, co-investors, and other strategic partners.\n* Provided 23 years’ worth of early-stage venture investment expertise and wisdom as advisory and due diligence support for all deal leads that advanced through the IC pipeline in 2025.\n\n**Why are you interested in serving on the AGV Council again?**\n\n“I genuinely enjoy working with the people on the investment team and the wider AGV stakeholders. This is a unique experiment and opportunity for a leading L2 network to pioneer what DAOs can do, and the mandate to grow one of the largest verticals within entertainment and gaming is exciting. There are challenges, but I have always believed in forging new frontiers while accepting the risks that come with innovation. I have advised multiple Fortune 500 corporations in forming and implementing corporate strategic investment programs, and to do something similar for the AGV is a chance to build an investment and ecosystem program in a wholly new format for the web3 world. I’m proud to be part of this journey, and hold huge hopes for how Arbitrum and web3 overall can bolster the leading edge of gaming and gamified experiences, as well as the convergence of generative AI with blockchain.”\n\n# Timeline\n\nAn Introduction and Q&A Call was held via Google Meet on November 13th at 5pm UTC.\n\nEach nominated candidate will undergo a separate confirmation Snapshot vote on Thursday, November 20th (this post).\n\n# Voting Options\n\nThis proposal will include the following voting options:\n\n* For\n* Against\n* Abstain\n\nShould FOR be the majority preference, and the combined FOR and ABSTAIN votes meet at least 3% of the total votable ARB supply, the respective candidate will be considered reconfirmed to the AGV council for the 2026 term.\n\nIf this nomination is vetoed by the DAO, that seat will then be added to the Election Process, and the nominee will be automatically entered as an applicant for the Election. If a nominee is vetoed and added to the Election, the number of open seats would increase from three (3) to either four (4) or five (5) seats.",
      "type": "basic",
      "start": 1763639625,
      "state": "closed",
      "title": "Tim Chang reconfirmation for AGV council",
      "votes": 1903,
      "author": "0x4F685B29514eed0c9D929386E86D9cd81981118B",
      "quorum": 0,
      "scores": [
        126241128.54095578,
        7013832.922955357,
        43466248.44480005
      ],
      "choices": [
        "For",
        "Against",
        "Abstain"
      ],
      "created": 1763639625,
      "scores_total": 176721209.9087112
    },
    {
      "id": "0x4a96a91d162975de0d402b83ca8b8a24e808ca357150120fc0d44ae0bf1cc4a5",
      "end": 1763657700,
      "body": "Constitutional proposal\n\n**Updated 10 November 2025:** This proposal has been amended to include an increase in the L2 min base fee from 0.01 gwei to 0.02 gwei. This change is proposed to be executed by an ArbOwner precompile call to the _setMinimumL2BaseFee_ function and will solely be a parameter/configuration change.\n\n# **Abstract**\n\nThis AIP proposes to reduce the severity, frequency, and duration of high L2 gas prices during periods when demand exceeds the gas target by introducing a new set of gas targets and new, accompanying adjustment windows for Arbitrum One and Arbitrum Nova. The starting effective (lowest) gas target of the chain is proposed to be 10 Mgas/s with an adjustment period of 86,400 seconds (1 day). These changes are intended to replace the current 7 Mgas/s gas target, which is used to adjust the L2 gas price using an [EIP-1559](https://eips.ethereum.org/EIPS/eip-1559)-inspired algorithm relative to the current 102-second adjustment window.\n\nThe AIP requests that the ArbitrumDAO grant Offchain Labs the right (for 2-years, measured from this proposal’s mainnet activation) to add up to 10 gas targets and adjustment windows, and to modify them over time—up to 100 Mgas/s and 86,400s, respectively. These changes will be introduced gradually to protect network stability while addressing high gas price volatility. The rollout begins with 6 new gas targets, each paired with its own adjustment window.\n\nLastly, this AIP is accompanied by an increase in the minimum L2 base fee from 0.01 gwei/gas to 0.02 gwei/gas to help reduce spam and offset any potential decline in the portion of L2 surplus fee-derived transaction fees (during periods of peak demand) to the ArbitrumDAO.\n\nThese updates and delegated rights are proposed by Offchain Labs in its role as an Arbitrum Aligned Entity (AAE), as described in [_A Vision for the Future of Arbitrum_](https://forum.arbitrum.foundation/t/a-vision-for-the-future-of-arbitrum/28962). Offchain Labs serves as an AAE for engineering, product, business development, and technical research.\n\nAll changes will be gated through smart contracts and DAO votes. Activation will require an on-chain vote, a security audit, and deployment of a new Resource Constraint Manager contract to manage permissions. If approved, only Offchain Labs will be authorized to adjust the parameters within the approved limits.\n\nThe proposal also outlines the rationale, risks, tradeoffs, and supporting data behind these changes. It applies solely to ArbitrumDAO-owned chains—Arbitrum One and Arbitrum Nova.\n\n## **Rationale**\n\n**How gas costs are priced today**\n\nArbitrum chains determine transaction gas fees using two components:\n\n1.  L1 gas costs – the expense of posting data to the parent chain.\n    \n2.  L2 gas costs – the resources consumed on the child chain (computation and storage).\n    \n\nL1 gas costs depend on the price of calldata or blobs on the parent chain, while L2 gas costs depend on network demand. Today, when demand on Arbitrum One exceeds 7 MGas/s, the L2 base fee increases exponentially — using a mechanism similar to Ethereum’s [EIP-1559](https://eips.ethereum.org/EIPS/eip-1559) — until demand falls back toward the gas target over a 102-second adjustment window. Learn more about Arbitrum’s gas model [here](https://docs.arbitrum.io/how-arbitrum-works/gas-fees).\n\n**Negative impacts of elevated demand**\n\nDuring periods of high activity, L2 gas prices can rise sharply, which significantly increases transaction costs for users and developers. For example, on Oct. 10, 2025, Arbitrum One’s L2 gas price peaked at an average of 41 gwei/gas, resulting in roughly $9.49 in L2 gas costs to transfer an ERC-20 token ([source](https://app.hex.tech/8bb08a30-5c58-48c4-acb0-5a0515db9db2/app/030GmGbKtvc6FtI1jIYB5h/latest), and assumes 60,000 gas and a price of $3,855 per Ether).\n\nThese high L2 gas price spikes are the motivation behind this AIP: to mitigate the frequency and severity of congestion-driven cost increases. Notably, introducing multiple gas targets with overlapping adjustment windows has a greater combined effect on stabilizing prices than raising a single gas target or changing a single adjustment window alone.\n\n**Illustrative example**\n\nTo illustrate this, we analyzed how the L2 gas price would have changed during the demand surge on Oct. 10, 2025 and on Sept 22, 2025, under different gas targets and adjustment windows. The adjustment window is a time-based damping parameter that controls how slowly the L2 gas price responds to changes in demand on the network above the gas target. A larger adjustment window results in slower price adjustments relative to the gas target, while a smaller adjustment window results in faster price adjustments.\n\n![OCL Image 1.jpeg](ipfs://bafkreihunmtusohodn7qkygzzpxsqhdfooyuz5ehki7z4mmpcwe6zulzfa)\n\n_Figure 1: L2 gas prices calculated different pricing algorithms during a period of high congestion on Sept 22, 2025_\n\n![OCL Image 2.jpeg](ipfs://bafkreig2rpsqqkt57s5gsorcjmxurth2ldikg3l7mjiveiuphguvic2iia)\n\n_Figure 2: L2 gas prices from different pricing algorithms during a period of high congestion on Oct 10, 2025_\n\nBelow is a brief description of the colored lines and what they represent in each of the two figures above, while holding the minimum L2 base fee constant\n\n-   **Red lines:** Actual L2 gas price using today’s parameters (effective gas target of 7 MGas/s over a 102-second adjustment window), peaking near 4 gwei on Sept 22 (Figure 1) and 42 gwei on Oct 10 (Figure 2).\n    \n-   **Blue lines:** L2 prices using the new set of proposed gas targets and adjustment windows, with an effective 7 MGas/s target and 86,400-second window.\n    \n-   **Green lines:** L2 prices using the new set of proposed gas targets and adjustment windows, with an effective 10 MGas/s target and 86,400-second window.\n    \n\nLooking specifically at Figure 2 during the period of peak demand on October 10, 2025, notice how both the green and the blue lines produce a much lower L2 gas price of ~9 gwei during the same demand peak, representing a ~33 gwei difference when compared to the peak of the red line (which uses today’s single 7 Mgas/s gas target and 102-second adjustment window). The difference between the peaks is almost ~33 gwei (129% difference) despite the effective gas targets being very close. Both the green and blue lines show substantially lower peak prices — around 9 gwei — a 33 gwei (≈129%) reduction compared to the current configuration, despite similar effective gas targets.\n\n**Summary and the increase in the minimum L2 base fee**\n\nThis retrospective analysis shows that applying the proposed gas targets and adjustment windows would have significantly reduced L2 gas prices during the periods of peak demand on Sept 22, 2025 and Oct. 10, 2025. While this simulation does not predict future outcomes, it demonstrates that longer and overlapping adjustment windows can meaningfully dampen gas price volatility during periods of high demand.\n\nNaturally, this change will mean that during periods of peak demand, the portion of L2 surplus fee-derived transaction fees collected by the ArbitrumDAO will be lower going forward, compared to before. To offset this potential decline, this proposal is to be accompanied by a slight increase in the minimum L2 base fee from 0.01 gwei/gas to 0.02 gwei/gas. This slight increase in the minimum L2 base fee can also positively contribute to reducing spam on the network as well, since the base fee for all transactions will be slightly larger than before this change.\n\n## **Specifications**\n\n**New gas targets and adjustment windows**\n\nThis proposal replaces the current, singular gas target (7 Mgas/s over a 102-second adjustment window) with multiple gas targets across overlapping adjustment windows, as tabulated in Table 1 below.\n\n**Table 1: Proposed gas targets & accompanying adjustment windows**\n\n| Gas Target (Mgas/s) | Adjustment window (seconds) |\n|---------------------|-----------------------------|\n| 60                  | 9                           |\n| 41                  | 52                          |\n| 29                  | 329                         |\n| 20                  | 2,105                       |\n| 14                  | 13,485                      |\n| 10                  | 86,400                      |\n\n\nThese values were calculated using this model [here](https://colab.research.google.com/drive/1D28YghOmCjvvrLWS5FsTp5xNKz9JHAA3?usp=sharing), with inputs from internal benchmarking on a server hosted by a cloud provider. This model assumes that a node on the reference hardware can sustainably sync at 80 MGas/s and that the chain can tolerate a 20% increase in L2 gas price per second during periods of high demand. Reference hardware used for these tests was: 64 GB RAM, 8 CPUs (x86 architecture), and a locally attached NVMe drive (for AWS, [i4i.2xlarge](https://aws.amazon.com/ec2/instance-types/i4i/)). Note that the lowest gas target of the 6 being introduced is 10 Mgas/s, which will be measured over the longest adjustment window (86,400s). We refer to this proposed 10 Mgas/s gas target as the “long-term gas target” or “effective gas target” of the chain..\n\n**Special permissions to gradually adjust gas targets and adjustment windows, over time**\n\nSeparately, this proposal requests the ArbitrumDAO grant Offchain Labs permission, for 2 years from the mainnet activation of this proposal, to adjust the gas targets and adjustment windows in Table 1, in addition to the right to add up to 10 more gas targets and adjustment values. These rights will allow Offchain Labs to adjust these values over time and help the chain’s stability in a way that security is not negatively impacted as additional capacity is added. The rollout of these changes will be paired with continuous monitoring of how the user behavior, node operators, and the network itself respond to them. Summarized below in Table 1 are the values and ranges that this proposal grants Offchain Labs the right to adjust.\n\nTable 2: Proposed gas targets and adjustment window ranges that can be adjusted over time by Offchain Labs, should the permission be granted by the ArbitrumDAO\n\n| Parameter              | Range                                  | Status quo value |\n|------------------------|----------------------------------------|------------------|\n| Number of gas targets  | 1 to 10, inclusive                     | 1                |\n| Gas targets            | 7 Mgas/s to 100 Mgas/s, inclusive      | 7 Mgas/s         |\n| Adjustment windows     | 5 seconds to 86,400 seconds, inclusive | 102 seconds      |\n\n\n**Resource Constraint Manager Contract**\n\nLastly, if approved, there will be a new contract deployed called the ResourceConstraintManager that will give Offchain Labs the appropriate permissions to adjust the above values within the specified ranges in Table 2 over time, should this proposal pass. This new contract will be audited by an independent third party entity (Trail of Bits). A full audit report will be published alongside this proposal when it gets proposed in the eventual on-chain vote.\n\nThis new contract will contain an access list. We propose that the ArbitrumDAO use this access to designate Offchain Labs the right to invoke specific functions on the ArbOwner precompile to adjust the above values in Table 2, within certain ArbitrumDAO-approved bounds. Normally, ArbOwner parameter changes and function calls require an ArbitrumDAO vote. Implementing this ResourceConstraintManager contract will allow Offchain Labs to adjust these parameters in Table 2, within the proposed bounds, without the need for additional votes - should the ArbitrumDAO pass this proposal.\n\n**Changing the minimum L2 base fee**\n\nA change to the minimum L2 base fee is also included in this proposal and will be executed via a call to the ArbOwner _setMinimumL2BaseFee_ function. This will be a one-time adjustment from the current 0.01 gwei value to a new 0.02 gwei value.\n\n**Risks & Tradeoffs**\n\nThe addition of new, higher gas targets to a chain is not without tradeoffs. Below are some of the potential tradeoffs that the ArbitrumDAO and ecosystem should consider in their assessment of this proposal.\n\n#### **Accelerated state growth**\n\nA gas target increase translates to an increase to the demand threshold at which EIP-1559-style congestion pricing kicks in, which will invite more demand to the network. After profiling the type of gas used on Arbitrum One over a period of about 3 weeks, the gas rate associated with state growth was observed to remain [relatively stable over time](https://blog.arbitrum.io/dynamic-pricing-explainer/). It is believed that if the capacity of the chain increases, then the rate of storage growth is expected to also increase.\n\nWhile this issue presents a challenge regarding the size of the state database and the costs to maintain it over the long run (e.g., archive node operators), after careful consideration, we believe the below are sufficient justifications that support the current proposed course of action.\n\n1.  In September 2025, the [Erigon team announced](https://erigon.tech/introducing-erigon-nitro-for-arbitrum-sepolia/) the alpha release of their archive node support for Arbitrum Sepolia. Their team was able to reduce the Arbitrum Sepolia archive node size from 12 TB to 0.732 TB, a 94% reduction. The Erigon team is expected to deliver Arbitrum One mainnet support by Q1 2026. This achievement will mean that node operators can opt to run archive nodes using Erigon, significantly reducing the cost associated with maintaining a larger and faster-growing state database size (when compared to today’s Geth-based Nitro nodes).\n    \n2.  The majority of professional node operators surveyed run Arbitrum One nodes on bare-metal providers and in [RAID0 configurations](https://en.wikipedia.org/wiki/Standard_RAID_levels). This special type of setup grants node operators the flexibility and optionality to expand storage at more predictable (and sometimes lower) costs and in a horizontal fashion. Based on this information, we expect professional node operators to be able to adequately provision and scale up in their disk sizes over time.\n    \n3.  [In September 2025, AWS announced that it raised the limit on EBS GP3 volumes to 64 TB, up from 16 TB](https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-ebs-size-provisioned-performance-gp3-volumes/). Given that some instance families (e.g., i8g) have an upper bound of 32 EBS volumes, then the theoretical maximum that a node operator could provision on AWS would be 32 x 64 TB = 2048 TB. For NVMe drives, which we recommend for performance and latency today already, some instances offered by AWS go as high as 120 TB ([i8g](https://aws.amazon.com/ec2/instance-types/i8g/)) and 45 TB ([i7ie](https://aws.amazon.com/ec2/instance-types/i7i/)). We expect that cost reductions and other advancements to technology will continue to improve across all cloud providers, making access to these larger drives more affordable as time goes on (i.e., [Moore’s Law](https://en.wikipedia.org/wiki/Moore's_law)).\n    \n\nThe combination of the above 3 trends leads us to conclude that the risk of accelerated state growth, as a result of increased demand, can be reasonably managed in both the short and long term.\n\n#### **Updated minimum hardware requirements for node operators**\n\nAs noted in Table 1, the proposed starting gas targets and adjustment windows were computed using test results observed from syncing an Arbitrum node on reference hardware. The reference hardware used in these tests was 64 GB RAM, 8 CPUs (x86), and a locally attached NVMe drive formatted with ext4 (for AWS, i4i.2xlarge). Therefore, this proposal will accompany an increase in the minimum hardware requirements for node operators from the current specification. These requirements will be used as the foundation for future increases to the tech stack’s scaling capabilities.\n\nTable 3: Comparison of current and new minimum hardware requirements for Arbitrum Nitro full nodes, given the new gas targets being proposed\n\n| Arbitrum Nitro full node hardware requirements | Current (source) minimum | Proposed new minimum |\n|-----------------------------------------------|--------------------------|----------------------|\n| Total RAM (GB)                                | 16                       | 64                   |\n| Number of CPUs                                | 4                        | 8                    |\n| Disk type                                     | Local NVMe drive         | Local NVMe drive     |\n\n\nDespite the cost increases that come with higher hardware minimums, we believe that this increase is justified because:\n\n1.  [Surveys conducted with at-home node operators](https://discord.com/channels/585084330037084172/1043523039104606239/1418980839366201344) found that the majority of teams are already running Arbitrum Nitro full nodes on servers that have 12+ CPU cores, 64GB+ RAM, and NVMe drives. As such, we believe this change will bring the requirements in line with setups that teams use today.\n    \n2.  The current minimum CPU and RAM requirements for running an Arbitrum Nitro node were defined [over 3 years ago](https://github.com/OffchainLabs/arbitrum-docs/pull/85). As technology has improved and costs have decreased, we believe it makes sense to update this requirement to align with what the market can offer today at a similar price.\n    \n3.  Future chain capacity increases will benefit from better hardware, and so this update will establish a new baseline for how we scale Arbitrum technology in the future\n    \n\nOver the coming weeks, we will perform similar benchmarking tests on various other types of hardware using different workloads to understand the limitations of the Nitro node software. The results of these upcoming tests will help us further improve Arbitrum technology.\n\n#### **Spam, relative to organic traffic, could increase on Arbitrum One**\n\nAs mentioned above, a gas target increase translates to an increase to the demand threshold at which L2 congestion pricing kicks in. Doing this naturally invites more demand to the network and could, therefore, result in more spam relative to organic traffic and today’s level of spam, since there would be more capacity to transact on the chain. While spam can be monitored, it is difficult to predict exactly how much more spam could take place on the network as a result of this change, relative to organic traffic.\n\nTo counteract the potential increase in spam, Entropy Advisors, an Arbitrum Aligned Entity (AAE), has suggested this proposal be accompanied with a change in the minimum L2 base fee from 0.01 gwei to 0.02 gwei. This change is based on the assumption that inorganic demand (generated from bots or spam) are more price sensitive compared to organic demand.\n\nCareful monitoring and subsequent changes to the gas targets and their adjustment windows will be considered over time to better manage spam. We acknowledge that there is no single, one-size-fits-all solution to eliminating or reducing spam, and so this area remains a topic of ongoing research at Offchain Labs.\n\n#### **Slight increase in transaction costs**\n\nAn increase in the minimum L2 base fee will result in, overall, higher transaction costs for all users during all periods, assuming usage remains the same. However, we believe this change (from 0.01 gwei/gas to 0.02 gwei/gas) is small enough that regular users and applications will largely be unaffected. To illustrate this, a simple ETH transfer consumes 21,000 gas. At $3500 USD per ETH, this increase in the minimum L2 base fee would result in a ~ $0.000735 increase in cost for an end user (0.01 gwei/gas * 21,000 gas * 1e-9 gwei/ETH * $3500 ETH = ~$0.000735).\n\n## **Steps to Implement & Timelines**\n\nIf approved, these changes will be deployed with the values in Table 1, accompanied by continuous monitoring of the network and its response to the changes. With permission from the ArbitrumDAO, Offchain Labs may adjust these values over time to help maintain the stability and security of the network as the chain’s capacity increases.\n\nBelow are the approximate next steps and timelines for this proposal:\n\n1.  Formal submission to the ArbitrumDAO for consideration and assessment (this post)\n    \n2.  Discussion and productive iteration together with the community (1 week)\n    \n3.  Development and audit, by Trail of Bits, of the required changes to add multiple gas targets and adjustment windows, alongside the actual proposed starting parameter values (now through mid-November 2025)\n    \n4.  Temperature check vote on Snapshot (mid-November 2025)\n    \n5.  Arbitrum Sepolia upgrade to ArbOS 50, should the temperature check vote pass successfully (mid- to late-November 2025)\n    \n6.  Submission for inclusion in the ArbOS 50 on-chain vote (carried out on Tally) (early December 2025), should the temperature check vote pass successfully, alongside the publication of the audit report from Trail of Bits.\n    \n\n## **Overall costs**\n\nAll engineering and research conducted for this proposal was done so by Offchain Labs at no explicit or additional costs to the ArbitrumDAO",
      "type": "basic",
      "start": 1763052900,
      "state": "closed",
      "title": "AIP: Raise the gas target, min L2 base fee, & implement improvements to the pricing algorithm",
      "votes": 2073,
      "author": "0xb4c064f466931B8d0F637654c916E3F203c46f13",
      "quorum": 0,
      "scores": [
        128065217.99775216,
        3438.696204366795,
        9209493.474572884
      ],
      "choices": [
        "For",
        "Against",
        "Abstain"
      ],
      "created": 1763052636,
      "scores_total": 137278150.16852942
    },
    {
      "id": "0x23702e34d0ffdabe6e17315f81daaf4119a36d108326473a6e063a35da5ba281",
      "end": 1763031613,
      "body": "## Summary\n\nThis proposal seeks DAO approval for an updated compensation framework for the Arbitrum Gaming Ventures (AGV) Council.\n\nFor the current Council (Year One), we recommend a one-time **startup-phase bonus** of **90,000 ARB tokens** per member, fully vested, in recognition of the heavier-than-anticipated contributions required to establish AGV’s structure, processes, and early investment strategy during its startup phase.\n\nThis startup phase bonus is a retrospective acknowledgment of extraordinary effort, not an element of the benchmark alignment. Additionally, these changes will be fully funded within AGV’s existing operating budget and require no additional DAO funds\n\n## Rationale\n\nThe startup responsibilities required to transform AGV from a concept into a functioning business entity were not envisaged at all in the original Tally proposal. During AGV’s launch, Council members undertook a heavier, more hands-on workload than was scoped or anticipated. This extra work undertaken during AGV’s startup phase was essential to successfully turn the original GCP Proposal into a functioning VC.\n\nThese startup-phase efforts, which were essential to successfully turn the original GCP Proposal into a functioning VC, are listed and expanded on in detail below:\n\n**Table B: AGV Startup Phase: Scoped vs Actual Council Workload**\n\n| **Category** | **Original Scope (4 hrs/week)** | **Startup Phase Scope (~10 hrs/week)** | **Notes / Impact** |\n| --- | --- | --- | --- |\n| **Risk Mitigation & Investment Thesis** | Advise on initial investment thesis and portfolio approach | Contributed to initial portfolio strategy design, including risk policies and compliance checks | Front-loaded work to ensure robust oversight scaffolding and 0-1 strategic direction |\n| **Team Oversight & Nominations** | Provide oversight and input on GCP team members and performance | Direct involvement in early hiring of core partners; provided input on org design | Higher time intensity due to recruitment, headcount planning, and onboarding of initial team members |\n| **DAO Liaison** | Serve as liaison and oversight committee between DAO and GCP initiative | Engaged in foundational DAO communications, collaboration with Arbitrum Foundation, legal, ensuring transparency during setup | Higher oversight/responsibilities, frequency of updates needed at launch |\n| **Compliance & Governance** | Complete NDAs, KYC, disclose conflicts; uphold Arbitrum Constitution | Helped shape governance documents (bylaws, entity setup), ensuring legal/structural alignment with DAO goals | Expanded scope vs. original role |\n\nThe AGV team fully supports fair recognition of the Council’s critical role during the program’s inception. The proposed startup-phase bonus specifically acknowledges the extraordinary, front-loaded effort involved in designing AGV’s foundational systems and launching its operations. This one-time award is separate from the forward-looking, market-benchmark adjustment and reflects the Council’s instrumental work in positioning the program for scale.\n\n## Process, Implementation & Next Steps\n\nThe AGV team, in carrying out its responsibilities under the [Foundation Bylaws](https://arbitrumgamingventures.com/governance) to manage general and administrative matters of the GCP Program, including finance and human resources, prepared this proposal using industry and compensation benchmarks, as well as a comparison of the Council’s originally laid out scope, and the additional startup phase scope that was required of them, along with its impact. The proposal was presented to the Council, which provided key input but recused itself from the decision-making process to avoid any conflict of interest. The Foundation Director has reviewed and approved the proposal in its current form.\n\nIn order to seek tokenholder approval on financial discrepancies between the original GCP Proposal and this proposal, the AGV team and Council now submit this proposal for a DAO vote.\n\n**If the proposal passes:**\n\n- The **startup-phase bonus** will be distributed to each current AGV Council member promptly after the vote concludes.\n\n### **Timeline**\n\n- The master proposal was [resubmitted to the forum](https://forum.arbitrum.foundation/t/proposal-agv-council-compensation-calibration-benchmark-for-next-term-startup-phase-bonus/29424/12?u=arbitrumgaming) on 2nd October 2025.\n- The previous vote [scheduled on 9th October](https://forum.arbitrum.foundation/t/proposal-agv-council-compensation-calibration-benchmark-for-next-term-startup-phase-bonus/29424/14?u=arbitrumgaming) was been [removed from Snapshot](https://forum.arbitrum.foundation/t/proposal-agv-council-compensation-calibration-benchmark-for-next-term-startup-phase-bonus/29424/23?u=arbitrumgaming).\n- [**Proposal A (Benchmark Calibration for Future Council Members)**](https://snapshot.box/#/s:arbitrumfoundation.eth) was posted to Snapshot  on Thursday, 16th October and passed.\n- **Proposal B (Startup-Phase Bonus for Current Council Members)** will be posted to Snapshot voting on Thursday, 6th November (this proposal).\n\n### **Voting Options**\n\nThis proposal will include the following voting options:\n\n- For\n- Against\n- Abstain\n\nShould FOR be the majority preference, and the combined FOR and ABSTAIN votes meet at least 3% of the total votable ARB supply, the proposal will be considered approved and may proceed to implementation.",
      "type": "basic",
      "start": 1762426813,
      "state": "closed",
      "title": "AGV Council Compensation Calibration: Startup-Phase Bonus for Current Council Members",
      "votes": 2154,
      "author": "0x4F685B29514eed0c9D929386E86D9cd81981118B",
      "quorum": 0,
      "scores": [
        113097018.72498624,
        13051402.644064087,
        39430644.257305786
      ],
      "choices": [
        "For",
        "Against",
        "Abstain"
      ],
      "created": 1762426813,
      "scores_total": 165579065.62635612
    },
    {
      "id": "0x44dedacbdae958904427db9ee93065917f57f50b71b4e87a94a318de18df399b",
      "end": 1761841200,
      "body": "# Abstract\n\nIn order to foster good governance participation in the ArbitrumDAO, this proposal puts forward the DAO Incentive Program, distinguishing between delegates, rewarded for their voting record and public rationale, and contributors, rewarded through a peer recognition program and \"Nudge Seasons\" to encourage positive governance actions. Since it serves as a continuation of, and builds upon learnings from the [Delegate Incentive Program](https://www.tally.xyz/gov/arbitrum/proposal/7979895167029508946638584765496434407327098393519089113101189960001594458109?govId=eip155:42161:0x789fC99093B09aD01C34DC7251D0C89ce743e5a4), we refer to it as DIP 2.0.\n\n# Key Terms\n\n* **Delegate:** A party with voting power used to vote on proposals, eligible for voting activity-related incentives.\n* **Contributor:** A party who positively supports ArbitrumDAO governance and/or the broader Arbitrum ecosystem.\n* **Peer Assembly:** A peer-to-peer community group enabling contributors to receive rewards.\n  * **Vouches:** Public endorsements from existing members and Arbitrum Aligned Entities (AAEs), required for new members to join the Peer Assembly.\n* **Peer Recognition:** A monthly reward system for impactful contributions to the ArbitrumDAO/wider ecosystem.\n  * **Peer Assembly Recommendations:** Submissions made by Peer Assembly members and AAEs to nominate impactful contributions for rewards.\n* **Nudge Seasons:** Time-bound initiatives to encourage specific positive behaviors among contributors.\n* **OpCo:** The AAE overseeing the DIP 2.0, authorized to modify the program, hire/terminate the Program Manager, and approve budgets.\n* **Program Manager:** The team hired by the OpCo to handle day-to-day operations of the DIP 2.0.\n\n# Motivation and Rationale\nWe propose a new incentive program for the ArbitrumDAO that separates out rewards for delegates and contributors:\n\n* **Delegate.** A party with voting power with the capability to vote on proposals.\n* **Contributor.** A party who positively supports ArbitrumDAO governance and/or the broader Arbitrum ecosystem.\n\nA delegate can be a contributor, but we should not assume that a contributor must be a delegate. \n\nThe incentive reward paid to delegates will only focus on their voting record and making public the rationale behind their decision. On the other hand, for contributors, there will be two forms of rewards available:\n* **Peer recognition program.** Focus on identifying impactful contributions in the DAO based on the recommendation of their peers.\n* **Nudge seasons.** Nudge the behaviour of contributors towards actions that are perceived as positive for the Arbitrum ecosystem as a whole.\n\nWe note the DAO incentive program should not replace a salary-like paid role or be sufficient to self-sustain an individual. However, it could be a stepping stone to enable parties to eventually find part time or full time work in the ecosystem. Most importantly, all payments should be viewed as a ‘thank you’ from others in the community. \n\nTo make the above work, we also propose introducing an **Arbitrum Peer Assembly** via a peer-to-peer vouching system. It requires existing members and/or AAEs to vouch for others to join before they are eligible for any payments, for delegates and/or contributors, in the DAO incentive program. The vouching system is designed to allow members to hold each other accountable and boost comradery among participants.\n\n# Specification\n## Rewarding Active Delegates\n\nThis program is designed to be objective and on a per-proposal basis. Any member of the Arbitrum Peer Assembly is eligible to receive a payment provided they:\n\n* Cast a vote on a proposal,\n* Publicly post rationale for how they voted and why.\n\n### Tracking Active Voters\n\nLong-term program objectives are measured through the following key performance indicators:\n\n* **Increased active voting power.** The total amount of active voting power is steadily increasing over time.\n* **Reduced voter apathy.** The share of active voting power compared to total delegated voting power is increasing over time.\n\nThe following metric will be used to track the cost-effectiveness of the program:\n\n* **Dollar spent per vote cast.** A cost-efficiency metric that measures the total program expenditure divided by the number of votes incentivized in a proposal. It represents how much funding is required to generate a single vote through the program.\n\nThe cost-efficiency metric should find a fair cost per vote that encourages delegates to participate without overspending the budget. For example, if the incentive budget per proposal is $10,000 and if the program manager decides to incentivize up to 200,000,000 votes per proposal, then the dollar spent per vote cast is 0.00005.\n\n### Periodic Incentive Budget\n\n|Proposal type|Incentive Budget|Payout Cap|Reward Distribution|Contributor Bonus|\n| --- | --- | --- | --- | --- |\n|On-chain constitutional|10,000 ARB|700 ARB|Proportional to voting power|1,000 ARB|\n|On-chain funding transfer|8,000 ARB|500 ARB|Proportional to voting power|1,000 ARB|\n|Off-chain decision making|8,000 ARB|500 ARB|Proportional to voting power|0 ARB|\n|Off-chain temperature check (non-binding)|3,000 ARB|300 ARB|Quadratic relative to voting power|0 ARB|\n\n*Table 1: A hypothetical illustration of incentive grant budget for delegate rewards*\n\nAs seen in Table 1, the program manager, in agreement with the OpCo, is required to set out an incentive grant budget that is paid on a per-proposal basis:\n\n* **Proposal type.** Type of decision voted on by the DAO,\n* **Incentive budget.** Budget allocated to a single proposal,\n* **Reward distribution curve.** Strategy for allocating the incentive grant to active voting power,\n* **Payout caps (per proposal).** Maximum incentive grant a delegate can receive from this vote.\n* **Contributor bonus.** A bonus that is split between assembly members nominated by the proposal author.\n\nThe incentive grant budget for proposals that are published within a 3-month period must be shared at the start of every 3-month period by the program manager alongside an optional maximum cap for the entire period. \n\nThe intention is to provide delegates with predictability on the reward structure in the coming months while allowing the payout strategies to change over time. For example, as seen in Table 1, if an on-chain constitutional proposal is voted on by the DAO, then a 10k ARB incentive grant will be allocated for that specific proposal. \n\nThe program manager, in agreement with the OpCo, reserves the right to offer **bespoke incentive grant budgets** for specific proposals. For example, if the DAO is required to participate in several sub-proposals within a single initiative (like in the STIP), then all such proposals may fall within a single bespoke incentive budget. They may decide not to offer any reward in order to prevent potential abuse such as an avalanche of unnecessary proposals or decisions that are deemed very minor in nature (including cancelled proposals). If so, the rationale should be published prior or during the on-chain/off-chain proposal by the program manager.\n\nThe **contributor bonus** allows the proposal author to nominate contributors who made a meaningful impact on the proposal. This is not limited to posts on the forum, but any communication medium that enables the contributor to support the proposal author. The proposal author can name a handful of contributors alongside a short description on each contributor’s impact on the proposal. This is sent to the program manager, who will then publish it to the DAO. The bonus will be split between the named contributors. The contributor bonus is optional and it should be viewed as a small ‘thank you’ for making the proposal better.\n\nFinally, the **incentive budget should define a minimum voting power** required to be eligible for delegate rewards. It will apply across all proposal types. This should be set to a reasonable value to help reduce the overhead of tracking rewards.\n\n## Peer Recognition Program for DAO Contributors\n\nThe program is designed to recognise contributors who have made meaningful contributions to the ArbitrumDAO or the wider ecosystem as acknowledged by their peers.\n\n### Eligible Contributions\n\nThe contribution should be:\n\n* Worthy in stature such that there is likely to be no objection that the work deserves praise among the DAO,\n* Not solely restricted to activities within the DAO, but any contribution that aids and strengthens the Arbitrum ecosystem,\n* Focused on voluntary activities, but eventually recognized by others as impactful.\n\nThe program may reward recurring tasks, but it should be an exception. For example, if a contributor hosts a monthly call, this will not result in a payout being issued every month.\n\n### Rankings and Rewards\n\nThe program manager is expected to act as an ordering service:\n\n* Review all recommendations,\n* Pick a final ordering,\n* Require approval from the OpCo (including any required modifications).\n\nThe full final ranking will not be publicly released. Only the top N recommendations, where N is a program-defined threshold, will be published to the DAO. Each selected recommendation from the top N will receive a fixed payout.\n\nAdditionally, if there is an outstanding contribution, the program manager (with agreement from the OpCo), can issue a ‘special reward’ with a higher payout. These should be rare and generally a moment of great praise.\n\nInitial Configuration for Peer Recognition Program.\n* $500 in ARB per recommendation,\n* N=5, top 5 recommendations,\n* Up to $2,500 in ARB per-month for the outstanding contribution reward.\n\nFor clarity, there is no obligation to publish exactly N recommendations every month. Only those deemed worthy of a reward should be published and in some months there may be none. If there are too many worthy contributions to fit within a single month, then the program manager can carry some over to future months, to ensure that eligible contributions are eventually recognized.\n\n### Submission process\n\nEvery month, the program manager will request all members of the Arbitrum Peer Assembly, as well as AAEs, to submit their recommendations. It should be written in the following format:\n\n* Contributor’s name:\n* Contribution:\n* Why was it impactful:\n\nNote, the recommendation should be concise and easy to digest as it will be published (alongside the reward) if it is chosen by the program manager. A participant can also submit a recommendation that covers their own actions.\n\nThe recommendation must be sent privately to the program manager. It is up to the recommender to ensure the program manager has acknowledged that it was indeed received by them.\n\n*For Example:*\n\n* *Contributor’s name: tnorm*\n* *Contribution: Shepherding the STIP proposal*\n* *Why was it impactful: The DAO was in a gridlock. Camelot’s proposal had failed, not because it was bad, but other DeFi protocols wanted access to incentive grants too. It became a tragedy of the commons that tnorm was able to resolve. He helped push a proposal through the DAO that enabled the wider community to decide the allocation of incentive grants and gave all protocols a fair shot at receiving them.*\n\n### Review process\n\nThe program manager will collect and review all recommendations. It is their job to rank the recommendations according to a set of principles. For example:\n\n* **Originality & Initiative.** Did the contributor proactively identify and address a gap or need?\n* **Arbitrum’s image.** Does the contribution enhance the overall perception of Arbitrum in the wider community?\n* **Knowledge sharing.** Has the contributor made their work accessible so others in the DAO can learn from it?\n* **Impact.** Did the contribution meaningfully advance an initiative that would otherwise have slowed in progress, stalled, or simply failed?\n* **Sustainability & Relevancy.** Can the work be maintained, scaled or built upon by the DAO?\n* **Peer Recognition.** Would other contributors and delegates widely acknowledge this as a meaningful and worthy contribution?\n\nOf course, we expect other considerations to arise over time and this list should not be viewed as exhaustive. The list simply helps set the tone on what it means for a contribution worthy of stature. An updated list of principles will be published to the DAO periodically to ensure everyone is aware of the criteria used to rank the recommendations.\n\n## Nudging Contributor Behaviour\n\nThe program is designed to nudge certain behaviours of participants that can positively impact the Arbitrum ecosystem through the offer of rewards.\n\n### Prior Success\n\nIn the previous iterations of the delegate incentive program, we witnessed delegates perform actions in order to earn rewards, such as leaving comments on the forum, joining governance calls, or voting early in Security Council elections.\n\n### Nudge Season\n\nThe program manager, with agreement of the OpCo, can put together ‘nudge seasons’ where contributors are offered a reward for performing certain actions within a timeframe. The contributors can provide evidence to the program manager that they have completed the action, as specified by the program manager at the time of the nudge season being announced, and if evaluated by the program manager as doing so, they will then be eligible to receive a payment for doing it.\n\n*For example:*\n\n* *“A budget of 3000 ARB will be split among all voters who cast their vote within the first 5 days of the Security Council elections. It will be paid out proportionally based on the voting power that participates in this nudge season.”* \n\nAnyone who is registered in the DAO incentive program’s Peer Assembly will be eligible as long as they adhere to the conditions of the nudge season. In the above example, whether or not they meet criteria can be proven by on-chain activity.\n\nAll ‘nudge seasons’ should be accompanied with a single KPI/metric that can be used to evaluate whether it was successful in nudging behaviour. The program manager should provide a small report with data that demonstrates if the KPI was achieved after the nudge season has concluded. \n\nA nudge season can be broad and may cover activity within the Arbitrum ecosystem. This may include participation in governance, helping real-world events or amplifying announcements. What will be nudged is subjective in nature, but when it comes to evaluating whether the behaviour was nudged, that should remain as objective as possible. \n\n## Arbitrum Peer Assembly\n\nThe DAO Incentive Program introduces a new community where parties can only join if they are vouched by existing members and/or AAEs. The intention is to enable the DAO to hold each other accountable to their actions. All payments in the DAO incentive program are contingent upon joining this assembly.\n\n### Bootstrapping Eligible Members\n\nWe have picked the top 8 earners from the soon expiring Delegate Incentive Program from (January - August) 2025 to bootstrap the initial list of eligible members:\n\n* L2Beat\n* Jojo\n* Tekr0x.eth\n* MaxLomu\n* TempeTechie\n* Reverie\n* GFXLabs\n* Gauntlet\n\nThere are some special requirements for these members:\n\n* Must receive 3 vouches within the first 2 months of the program starting,\n* Cannot receive a vouch from someone who they directly vouched to join the program,\n* Initial members cannot vouch for each other.\n\nThe intention to keep this list short is to make this process manageable and it should not be perceived as a special privilege.\n\nAdditionally, to aid the bootstrapping process, all registered members can offer multiple vouches until 50 members have registered in the program. Priority registration will be given to members who were previously registered in DIP v1.7. Once 50 members are registered, then all members will be restricted to 1 vouch per month. \n\n### Vouching Process\n\nA dedicated thread on the Arbitrum Forum should be created for the new member who wants to join:\n* Brief description of the candidate alongside why they want to join,\n* 3 members must reply and publicly vouch for the new member to join.\n\nOnce a member receives enough vouches to join the assembly and assuming any compliance requirements are completed, the new member will then be considered a member of the program and will have the authority to make their own vouch for others to join. As is the case for the initial members, new members also cannot receive a vouch from someone who they directly vouched to join the program. Registration is only finalized once it is confirmed by the program manager on the relevant thread.\n\nIf a member wants to remove their vouch, then they will be required to reply on the same thread that it should be removed.\n\nIf a member has left the program for whatever reason (i.e., inactive), then the relevant forum thread will be locked.\n\n### Tracking of Rewards \nThe Program Manager is responsible for keeping track of all rewards for delegate voting, the peer recognition program, and the nudge seasons. It should be available on a public spreadsheet for all members to access. \n\nFor clarity, all records should be kept on a per calendar month basis, and payouts should be issued shortly after month’s end. When payouts are computed, the program manager should accurately keep track of total accrued rewards and total payouts, to ensure only the difference carries over to the next month. \n\nAll members already registered in the Arbitrum Peer Assembly will automatically accrue rewards. A member must earn at least $200 across the DAO incentive program before a payment is issued. The allocation will carry over to the next calendar month, but it will expire after 3 months if the threshold is not reached. This is simply to avoid sending dust transactions alongside the overhead in doing so. \n\nFinally, non-members who have registered their intent to join the program via the Arbitrum Forum, can accrue rewards. They must complete the vouching and compliance process within the same calendar month that they submit their application to the program, in order to be officially registered into the assembly. If they fail to register by the month’s end, then they will forfeit any accrued rewards.\n\n### Governing Rules\n\nAll members are required to adhere to the [program’s terms and conditions](https://docs.google.com/document/d/1CEQc0o-FSAakgFL8wbTiqzeX-PtC5TBHj0BjonFNftI/edit?usp=sharing) which outline the expected behaviour of members and how they conduct themselves when interacting with others.\n\nAdditionally, there are some program-specific rules, that will be enforced:\n\n* **Active members only.** If a member has not received any payments in a 6 month period, then they will be removed from the program.\n* **Minimum recommendations.** If a member leaves the program, then the party will have to find a replacement to vouch for them within 2 months.\n* **Non-Transferability.** Membership is tied to a single individual or entity.\n* **Vouch accountability.** If a member is penalized, then the members who vouched for them may also incur a penalty.\n* **One vouch per month.** A member can only vouch for one candidate per month.\n\nFor clarity, it will be the Program Manager’s responsibility, with the OpCo’s approval, to uphold the rules with the ability to suspend or ban members from the Arbitrum Peer Assembly. If there is disagreement with the enforcement, then an appeal can be made to the OpCo who will make the final decision.\n\n### Membership Depends on Humanity\n\nThe DAO Incentive Program’s goal is to activate delegates and contributors who will express their opinion through voting or participating in governance. The program will exclude platforms that enable non-human activity (i.e., AI agents) or enable token holders who sell their votes for short-term profits. Additionally, all organisations classified as an AAE and the Program Manager, will not be allowed to earn any payouts, but will have the power to offer vouches for new members.\n\n## Facilitated by the OpCo\n\nThe Arbitrum OpCo Foundation (“OpCo”) retains the authority to change any aspect of the program. Any major change to the program should be published publicly to notify members of the Arbitrum Peer Assembly.\n\nAdditionally, the OpCo are in charge of hiring (and terminating) the program manager with an appropriate service level agreement. It is expected that the program manager will handle the day-to-day operations, but rely on instructions from the OpCo when necessary.\n\nThe Arbitrum Foundation, with agreement of the OpCo, will facilitate the program from the get-go with the intention that everything is eventually handed over to the OpCo. We expect different aspects of the DAO incentive program to be handed over as the OpCo ramps up. For clarity, anything that states “OpCo” in this proposal will be handled by the Arbitrum Foundation from the onset.\n\n# Budget\n\nThe Delegate Incentive Program [multisig](https://app.safe.global/balances?safe=arb1:0x07e7ef4B87Bb4115f7f507C89c2baC5F3342Cc3c) is still holding approximately 7 million ARB. The DAO incentive program will absorb the entire budget for use in this program.\n\nThe OpCo will use this budget for:\n\n* Payouts related to the program,\n* Program manager compensation,\n* Other miscellaneous costs that arise.\n\nPayouts related to the program, including the delegate rewards, the nudge seasons, and the peer recognition program, will be published to the DAO on a regular basis. For example, in relation to the delegate voting, the budget is allocated every 3 months and the payouts tracked on a per-month basis. This empowers the DAO to monitor how the budget is being used in real-time.\n\nThe program manager’s compensation and scope of work will be announced after it is negotiated by the OpCo. This will be periodically reviewed by the OpCo and any changes will be published to the DAO.\n\nWe do not expect miscellaneous costs to be substantial. An initial budget of $50k per year will be allocated. If the costs exceed this budget, then the OpCo’s OAT must approve and notify the DAO.\n\nFinally, a transparency report will be prepared by the program manager and published every 6 months, to track total spend of the program alongside whether the key performance indicators and other relevant goals are being met.\n\n# Timeline\n\nThe official start date will be announced after the proposal has passed and members have begun onboarding to the Arbitrum Peer Assembly. The intention is for the DAO Incentive Program to run for 1 year. If the OpCo, based on feedback from members of the Assembly, deems the program is running well, it may authorise the program to continue operating beyond 1 year. If not, any excess funds will be returned to the DAO Treasury.\n\nThe off-chain proposal was posted on October 23rd and requires a non-constitutional quorum for it to pass. Assuming all goes well, the intention is to begin the program by November 1st, 2025. If the timetable is delayed, for whatever reason, then we plan to still allocate a budget and retrospectively reward any votes that have occurred during the intermission.",
      "type": "basic",
      "start": 1761236400,
      "state": "closed",
      "title": "The DAO Incentive Program (DIP 2.0)",
      "votes": 2076,
      "author": "0xd333Bc5c9670C9cEb18f9A2CF02C6E86807a8227",
      "quorum": 0,
      "scores": [
        10674325.451648775,
        115029292.88425288,
        57748424.094757326
      ],
      "choices": [
        "For",
        "Against",
        "Abstain"
      ],
      "created": 1761236089,
      "scores_total": 183452042.43065897
    },
    {
      "id": "0xb9e775ba4f1fa8cdc8e45c342428c3dabff7f19ce7b8cc4bde7cc6c8e542d963",
      "end": 1761257460,
      "body": "Hello all!\n\nThis is **not** a binding vote. It's just a temperature check vote to sense the appetite of the DAO towards **experimenting with an objective, rules-based, and algorithmic based Delegate Incentive Program**, that doesn't require a dedicated program manager to run it, and rewards delegates in a predictable, transparent, automatic, meritocratic, and faster way.\n\nPlease read the proposal below to understand the proposed program process, general rules, and specific parameters. All specific **[values]** are just a indicative example at this stage and will be decided and put for a binding vote later, but only if this vote has a favourable result.\n\nThank you for voting!\n________\n# Arbitrum Triple Dip (Delegate Incentive Program)\n**Non-Constitutional**\n\n## Abstract\n\nA new version of the Arbitrum DAO Delegate Incentive Program, that allows to reward both voters and contributors to the Arbitrum DAO in a predictable, easy to understand, objective, and meritocratic way.\n\nThis program was designed with the goals of:\n\n* incentivizing voting participation, forum engagement, and organic contributions to our DAO by distributing a fixed amount of rewards in a fair, transparent and decentralized way\n* reducing centralized subjectivity and evaluation bias of past delegate incentive programs\n* eliminating excessive program admin costs and manual processes\n* and producing monthly results and payouts faster and predictably\nEvery month, each delegate enrolled in the program can get 3 types of rewards, the **First Dip** (for their voting activity), the **Second Dip** (for their forum engagement), and the **Third Dip** (for their organic contributions), hence the tongue in cheek program name **Arbitrum Triple Dip**.\n\nHowever, delegates will only get rewards if they qualify for them, according to the following process:\n![Arbitrum Triple Dip small.jpg](ipfs://bafybeibepbtdfp3fdjfouwscq4y54em5llpsg563bfnehq4sg5enx73poa)\nAll parameters and amounts inside **[square brackets]** are just rough examples at this point, that should be decided by the DAO, as part of this collaborative process of designing the next version of the Delegate Incentive Program for Arbitrum DAO. Additionally, all other terms in bold in the diagram above, will be explained below.\n\n## Motivation\n\nA healthy Delegate Incentive Program is a requirement in any mature DAO that has actual onchain governance, and Arbitrum DAO is probably at a point where it cannot sustain itself without a program of this sort. The recent issues in [achieving quorum](https://forum.arbitrum.foundation/t/dvp-quorum-for-arbitrumdao/29996) on proposals, and the lack of organic, community driven initiatives and proposals since the introduction of the [new vision in April](https://forum.arbitrum.foundation/t/a-vision-for-the-future-of-arbitrum/28962/40), show that Arbitrum DAO clearly needs a program that incentivizes delegates adequately. This program should be designed to incentivize our community to show up, vote, and contribute to the DAO to the best of their abilities, and to attract new and talented members to our community.\n\nGiven how the [past versions of the program](https://forum.arbitrum.foundation/t/dip-v1-6-from-engagement-to-rewards-a-comprehensive-analysis-of-the-delegate-incentives-program/29475) evolved, and the [feedback](https://forum.arbitrum.foundation/t/dip-1-5-6-feedback-survey-results/29951) it generated, it is clear that the new delegate incentive program needs to be way more [predictable](https://forum.arbitrum.foundation/t/proposal-revert-the-delegate-incentive-program-dip-to-version-1-5/29867), [objective](https://forum.arbitrum.foundation/t/proposal-revert-the-delegate-incentive-program-dip-to-version-1-5/29867/40), [efficient](https://forum.arbitrum.foundation/t/proposal-revert-the-delegate-incentive-program-dip-to-version-1-5/29867/2), and [attractive](https://forum.arbitrum.foundation/t/proposal-revert-the-delegate-incentive-program-dip-to-version-1-5/29867/12).\n\nI’m now sharing here on the forum this proposal for a new delegate incentive program with the intent to kick-start a public and open discussion and deliberation process about it. The goal is to have a new, more adequate version of the program in effect from November 2025 onwards. More importantly, to have a version of the program that is designed and shaped in the open, by the biggest and most diverse body of stakeholders possible.\n\nEDIT: [Curia](https://forum.arbitrum.foundation/u/curia/summary) joined in on the program design, to contribute with the reward mechanism for the Second Dip and eventualy operationalize a live dashboard with the program results, given their relevant experience in other ecosystems.\n\n## Rationale\n\nThis version of the Delegate Incentive Program, the ***Arbitrum Triple Dip***, is focused on **incentivizing 3 main outcomes**:\n\n1. that all offchain and onchain votes have a legitimate level of participation by consistently hitting quorum levels and rewarding voters that have good governance participation records;\n2. that all valuable and helpful feedback that delegates write on the forum gets rewarded for their helpfulness and engagement over time;\n3. that all manner of valuable organic contributions are rewarded in a fair and legitimate way so that we can attract and keep talented contributors in Arbitrum DAO.\n\nThese 3 main outcomes shaped the format, rules, and characteristics of this proposed Delegate Incentive Program and improve on the previous versions of this program, namely DIP 1.5, DIP 1.6, and the currently active DIP 1.7.\n\nIt also keeps certain characteristics of the previous versions of the Delegate Incentive Program, like the [public Delegate Application Process](https://forum.arbitrum.foundation/t/delegate-incentive-program-1-7-application-thread-and-code-of-conduct-adherence/27969?u=paulofonseca) and adherence to the [Community Values](https://docs.arbitrum.foundation/dao-constitution#section-6-community-values) in the Arbitrum DAO constitution, the [Community Guidelines](https://forum.arbitrum.foundation/t/community-guidelines/12807), and the DAO [Code of Conduct](https://forum.arbitrum.foundation/t/the-arbitrum-dao-code-of-conduct/29713).\n\n## Specifications\n\n### Arbitrum Triple Dip Rules\n\nThis version of the Delegate Incentive Program, the Arbitrum Triple Dip, has the following rules, that we welcome all delegate feedback on, as presented in the illustrated process above:\n\n1. If in a given month, any offchain or onchain vote does have meaningful participation, aka, does not have more total casted voting power than the respective non-constitutional or constitutional quorum in effect at the time, nobody gets rewards, that month. (Except for “socially cancelled” onchain proposals)\n\n2. If in a given month, delegates don’t vote on at least **[100%]** of offchain votes and on at least **[100%]** onchain votes, they don’t get rewards, that month.\n\n3. If in a given month, delegates don’t have more than **[500,000]** ARB in average voting power, they don’t qualify for First Dip rewards, that month.\n\n4. First Dip rewards are fixed at **[30,000]** ARB per month, and fully distributed, proportionally, to the delegates that comply to the criteria 3 and 4 above.\n   a. For each delegate, the average of the casted voting power in all offchain and onchain votes in a given month, is used to compute the share of the First Dip rewards they receive. For example, if there are only 2 qualifying delegates, one with the higher voting power average of 9,000,000 ARB, and another one with the lower voting power average of 1,000,000 ARB, the first one receives 90% of the available First Dip amount, and the second one receives 10% of the available First Dip amount.\n\n5. If in a given month, delegates don’t have more than **[50,000]** ARB in average voting power, they don’t qualify for Second Dip rewards, that month.\n\n6. Each month, delegates should participate on the forum by commenting and ‘Liking’ others’ valuable posts. Contributions are measured by the **Peer Recognition Score (PRS)**, which is designed to reward quality over quantity.\n   a. Instead of scoring the comments themselves, the **PRS** is based entirely on the ‘Likes’ your comments receive from your peers which weights based on your reputation or voting power. At the end of each month, the system will calculate the score by looking at all the ‘Likes’ received, which are then normalized across the different threads in the forum. This means that accumulating a high volume of comments won’t improve your score; the goal is to make contributions that others find valuable enough to ‘Like’. For a full breakdown of the methodology, which is still being refined, please see the draft document [here](https://www.notion.so/curialab/Forum-Peer-Recognition-Score-Draft-v1-27d2dc1c1f798039ae44e70bfe7902d7?source=copy_link).\n\n7. Second Dip rewards are fixed at **[30,000]** ARB per month, and fully distributed, proportionally to their Peer Review Score, to the delegates that fulfil criteria 2, 5, and 6 above.\n\n8. If in a given **[quarter]**, delegates don’t have more than **[5,000]** ARB in average voting power, they don’t qualify for Third Dip rewards, that **[quarter]**.\n\n9. Every **[quarter]**, delegates enrolled in the program should post publicly, in a specific forum thread to be defined, up to **[5]** of their most impactful contributions each **[quarter]**, so that all enrolled delegates can evaluate the value of each other’s contributions, by casting a **valid** weighted vote in a shielded offchain vote, like this example [contributor evaluation vote](https://snapshot.box/#/s:arbitrumdoubledip.eth/proposal/0x5744ce013531ba5856d91c927e9a4814dfc774f0f09c09396cbd4e8586a66e1b), on this [snapshot.box sub-space](https://snapshot.box/#/s:arbitrumtripledip.eth) with an allow-list based membership that reflects the enrolled delegates in the program, each **[quarter]**.\n   a. A **valid** casted vote, in this contributor evaluation vote, is one where the allow-listed delegates enrolled in the program don’t vote for themselves. Any delegate that votes for themselves is excluded from Third Dip rewards.\n\n10. Third Dip rewards are fixed at **[120,000]** ARB per **[quarter]**, and fully distributed, proportionally, to the delegates that fulfill criteria 2, 8, and 9 above.\n   a. For each delegate, they will receive a share of the Third Dip rewards, proportional to the voting power that voted for them in the results of the *contributor evaluation vote*, given that they received more than **[10%]** of the voting power that the top delegate received. For example, if the highest voted delegate got 10,000,000 ARB voting for them, only delegates that got more than 1,000,000 ARB voting for them will get rewarded a share of the Second Dip rewards.\n\n11. There will need to be a maximum number of delegates rewarded by the program each **[quarter]**, for example **[50]** delegates, so that the total amount of reward per delegate is still enough to incentivize continuous contribution.\n\n12. All rewards are denominated and paid out in ARB. 1 ARB = 1 ARB.\n\n\n## Arbitrum Triple Dip Parameters\n\nRegarding the specific parameters values, the ones in **[square brackets]** both in the illustrated process and in the rules above, they are all up for further deliberation. These specific initially suggested values, mostly mimic the [August results](https://forum.arbitrum.foundation/t/dip-v1-7-delegate-incentive-program-results-august-2025/29977) of the 1.7 version of the currently active Delegate Incentives Program, assuming a $0.50 USD ARB price.\n\n* Minimum Monthly Offchain Vote Participation = **[100%]**\n   * this is a more demanding participation value than in the current DIP 1.7 because if we are going to pay delegates for voting, we should aim for delegates to have a perfect voting record.\n   * includes all votes on the arbitrumfoundation.eth Snapshot Space\n* Minimum Monthly Onchain Vote Participation = **[100%]**\n   * this is a more demanding participation value than in the current DIP 1.7 because if we are going to pay delegates for voting, we should aim for delegates to have a perfect voting record.\n   * includes all onchain votes in the Arbitrum Treasury Governor, all votes on the Arbitrum Core Governor, and all votes on the Security Council Governors\n   * excludes all “socially cancelled” onchain votes\n* Minimum Voting Power for First Dip Rewards = **[500,000]** ARB\n   * this mimics the current Tier X requirement of DIP 1.7\n* Fixed First Dip Monthly Rewards = **[30,000]** ARB\n   * this closely mimics the amount that was paid for Tier X delegates in the August DIP 1.7 results, assuming a $0.50 USD ARB price\n* Minimum Voting Power for Second Dip Rewards = **[50,000]** ARB\n   * this mimics the requirement to be eligible for rewards in DIP 1.5/6\n* Minimum Peer Recognition Score threshold = **[70]** points\n   * this is to ensure that only the highest quality comments are rewarded\n* Fixed Second Dip Monthly Rewards = **[30,000]** ARB\n   * this closely mimics the amount that was paid for Tier X delegates in the August DIP 1.7 results, assuming a $0.50 USD ARB price\n* Minimum Voting Power for Third Dip Rewards = **[5,000]** ARB\n   * this is to ensure that we have a bigger pool of contributors competing for these rewards\n* Time interval for Third Dip Contributor Evaluation rewards = **[quarter]**\n   * this is to ensure that delegates don’t have to report, review and vote on the contributor evaluation vote too often\n* Maximum Reported Contributions per month = **[5]**\n   * so that delegates keep their monthly report of contributions concise, to be respectful of delegates’ attention span, by prioritizing their most impactful contributions\n* Minimum Relative Contribution Cutoff = **[10%]**  of the voting power that the top delegate received on the monthly contributor evaluation vote results\n   * this is to establish a baseline of minimally valuable contributions, relative to the most valuable contribution each month.\n* Fixed Third Dip Monthly Rewards = **[120,000]** ARB\n   * this closely mimics the amount that was paid for Tier 1, 2, and 3 delegates in the August DIP 1.7 results, assuming a $0.50 USD ARB price\n* Maximum Number of Delegates Rewarded per month for First and Second Dip rewards = **[50]**\n   * this mimics the maximum amount of delegates to be rewarded on DIP 1.5/6/7\n\n## Retrospective comparison with DIP 1.7 results\n\n*(coming soon)*\n\n## Timeline of the Arbitrum Triple Dip Process\n\n![Cycle timeline.png](ipfs://bafkreih376qfygm3wg6lmac2hitxtkcuif3t2o45m2awpk7hdke3r56mzy)\nEvery **month**, delegates that have applied to the Arbitrum Triple Dip in that same month, and comply with the rules and parameters above, will be eligible for First Dip and Second Dip rewards.\n\nEvery **[quarter]**, delegates that have applied to the Arbitrum Triple Dip in that period, and comply with the rules and parameters above, will be eligible for Third Dip rewards.\n\nDuring this cycle, delegates can vote, comment, and contribute as they normally would, and then after that cycle ends, they should:\n\n* update their report with their top [5] most impactful contributions, between the 1ˢᵗ and the 5ᵗʰ of the following month, after the [quarter] ends.\n* vote, with a valid vote, in the contributor evalution vote in the specified snapshot space, between the 7ᵗʰ and the 14ᵗʰ of every month.\n\nThen, the Arbitrum Foundation and/or OpCo should process the payments in accordance to the rules and execute the First Dip and Second Dip payouts within 5 days, between the 1ˢᵗ and the 5ᵗʰ of every month, and execute the Third Dip payouts within 6 days, between the 14ᵗʰ and the 20ᵗʰ of the month after the **[quarter]** ending.\n\n### Process for delegates to apply to the Arbitrum Triple Dip\nAny delegate that wishes to be rewarded would need to apply to the Arbitrum Double Dip by posting their application to the forum, in a dedicated thread, similar to how it was done for version 1.5 on onwards of the DIP. All applications from DIP 1.5, 1.6 and 1.7 will be grandfathered in the Arbitrum Double Dip.\n\n### Process for suspending or banning delegates from the Arbitrum Triple Dip\nOnly the Arbitrum Foundation or the OpCo can decide to suspend for 1 or more months, or ban a delegate from the Arbitrum Triple Dip. Affected delegates can appeal and revert the decision with an offchain vote that achieves a favorable vote of more than 3% of votable ARB tokens.\n\n### Process for changing the above Rules and Parameters\nAny delegate can initiate a proposal here in the forum, and the respective offchain vote to change any of the rules and parameters in the Arbitrum Triple Dip. Any change could never be done retroactively, and would only be considered a valid change if it achieves a favorable vote of more than 3% of votable ARB tokens.\n\n## Steps to Implement\n\nIt depends on how the community receives this proposal. If this design for a Delegate Incentive Program is well received, we need to collaboratively define how to best implement this program in coordination with the relevant AAEs, namely the Arbitrum Foundation and OpCo.\n\nThe only operational thing that would be needed is to include the future Snapshot space for the contributor evaluation vote, as a sub-space of the [arbitrumfoundation.eth](https://snapshot.box/#/s:arbitrumfoundation.eth) Snapshot space, so that it could inherit the Snapshot PRO benefits of our current subscription that are needed to correctly realize the contributor evaluaton vote, every [quarter].\n\n## Timeline\n\nThis proposal aims for this version of the Delegate Incentive Program, the Arbitrum Triple Dip, to be in effect, from the month of November 2025 onwards.\n\nTo achieve that we should, in this order:\n\n1. agree on the **rules** of the next version of the Delegate Incentive Program\n   a. forum discussion, deliberation, and incorporation of delegate feedback until October 16ᵗʰ\n   b. temperature check offchain vote to determine if the DAO wishes to invest in a Delegate Incentive Program with this design, from October 16th to October 23rd\n\n2. agree on the specific **parameters** of the next version of the Delegate Incentive Program\n   a. temperature check offchain vote to ratify the program and to determine the specific total budget available for the first experimental 2 quarters of the program, with an offchain vote that needs to achieve the non-constitutional quorum from October 23rd to October 30th\n\n\n## Overall Cost\n\nDepends on the reward amounts that are chosen in the final offchain temperature check vote. Will update this section of the proposal accordingly, as soon as there is consensus in the first temperature check vote and before the second, binding, offchain vote that needs to achieve the non-constitutional quorum to pass.\n\nAssuming the preliminary parameters defined above, that were picked to mimic the spending of the last month of August under the DIP 1.7 version, this version of the Delegate Incentive Program would distribute 1,200,000 ARB per year at $0.50 USD per ARB, with virtually 0 admin costs, assuming the OpCo and/or the Arbitrum Foundation would take care of the minimal admin required, which they are already doing for the DIP 1.7 version.\n\nAssuming this proposal passes, we will use the still available DIP 1.5/6/7 budget and multisig controlled by the Arbitrum Foundation.",
      "type": "basic",
      "start": 1760652660,
      "state": "closed",
      "title": "[Temperature Check] Should we try a Delegate Incentive Program like the Arbitrum Triple Dip?",
      "votes": 2416,
      "author": "0xE594469fDe6AE29943a64f81d95c20F5F8eB2e04",
      "quorum": 0,
      "scores": [
        5611129.096538495,
        136845505.49148348,
        22235336.86185124
      ],
      "choices": [
        "For",
        "Against",
        "Abstain"
      ],
      "created": 1760642711,
      "scores_total": 164691971.4498732
    },
    {
      "id": "0xdfdf56e53e2a77968c2c124be9210a5f33cb2261cca00e1d6b04f8bb6dfa626d",
      "end": 1761221585,
      "body": "## Summary\n\nThis proposal seeks DAO approval for an updated compensation framework for the Arbitrum Gaming Ventures (AGV) Council for the next term.\n\nIn order to align AGV Council pay with external benchmarks for comparable advisory and portfolio-oversight roles across DAO, venture, and corporate board ecosystems, we recommend the following forward-looking adjustment to Council compensation packages, beginning with the next Council term:\n* Annualized Base Salary: $50,000 USD stipend (up from $30,000 USD) for Council members, and a $100,000 USD stipend for the Investment-Committee seat (up from $80,000 USD)\n* Bonus: 60,000 ARB token incentive vested on an accelerated 6-month schedule following the Council term.\n\nThese changes are intended as a one-time calibration, not a recurring increase. If approved by the DAO, they will not retroactively apply to the current AGV Council.\n\nAdditionally, these changes will be fully funded within AGV’s existing operating budget and require no additional DAO funds.\n\n## Rationale\n\nThe AGV Council provides sustained oversight of a program deploying 200m ARB in capital. Council members review investment strategies, guide strategic alignment within the Arbitrum ecosystem, and help maintain the integrity of AGV’s operations and budgets. \n\nCurrently, AGV Council members are compensated at rates that are below average when compared to comparable advisory and portfolio-oversight positions across DAO, venture, and corporate board ecosystems. \n\nFor detailed market comparisons that informed these compensation levels, see the table below: \n\n#### Table A: Industry & VC Compensation Benchmarks.\n\n| Role Type | Scope & Repsponsibility | Typical Annual Compensation | Structure | Benchamark Source |\n|----|----|----|----|----|\n| Corporate Board Members | Strategic oversight, quarterly meetings, minimal operational role | $45K – $90K | USD stipend + occasional equity | NACD, Spencer Stuart |\n| Board Advisors | Subject-matter expertise, low time commitment, very early stage startups | $30K – $60K | Cash + small equity grant (0.1–0.25%) | PwC, Deloitte |\n| Startup Advisors (Seed–A) | Hands-on product, GTM, or domain guidance for early-stage companies | $20K – $50K | Cash or 0.25–1% equity, 2–4 year vest (rarely becomes liquid) | Carta, AngelList |\n| OATs | Independent oversight, reporting accuracy, compliance checks, covers many initiatives, up to 10h a week commitment, diverse responsibility | \\~$90K USD + 100k ARB (\\~$50k) = $140K Total | The bonus payment is vested, with funds released after a 24-month cliff following the term’s end | Arbitrum OAT |\n| *Current AGV Council* | *Provide oversight and input program performance, operations, and DAO transparency* | *$30k ($80k for IC member)* | *USD annualized base compensation* | *AGV* |\n\nThis forward-looking adjustment will increase the annualized base salary of each Council member by $20,000 USD, plus grant each member a bonus of 60,000 ARB tokens, vested on an accelerated 6-month schedule following the Council term. \n\nAdjusting Council compensation in this way will set a sustainable baseline for future Council service, while the inclusion of a bonus denominated in ARB tokens directly aligns Council’s contributions with the long-term health and growth of the Arbitrum ecosystem, incentivizing responsible and effective oversight and input.  \n\n## Process, Implementation & Next Steps\n\nThe AGV team, in carrying out its responsibilities under the [Foundation Bylaws](https://arbitrumgamingventures.com/governance) to manage general and administrative matters of the GCP Program, including finance and human resources, prepared this proposal using industry and compensation benchmarks identified in Table A (above). The proposal was presented to the Council, which provided key input but recused itself from the decision-making process to avoid any conflict of interest. The Foundation Director has reviewed and approved the proposal in its current form.\nIn order to seek tokenholder approval on financial discrepancies between the original GCP Proposal and this proposal, the AGV team and Council now submit this proposal for a DAO vote.\n\nIf the proposal passes:\n* The new compensation framework will take effect with the start of the next AGV Council term.\n\n## Timeline\n\n* The proposal was [resubmitted to the forum](https://forum.arbitrum.foundation/t/proposal-agv-council-compensation-calibration-benchmark-for-next-term-startup-phase-bonus/29424/12?u=arbitrumgaming) on 2nd October 2025.\n* The previous vote [scheduled on 9th October](https://forum.arbitrum.foundation/t/proposal-agv-council-compensation-calibration-benchmark-for-next-term-startup-phase-bonus/29424/14?u=arbitrumgaming) has been [removed from Snapshot](https://forum.arbitrum.foundation/t/proposal-agv-council-compensation-calibration-benchmark-for-next-term-startup-phase-bonus/29424/23?u=arbitrumgaming).\n* Proposal A (Benchmark Calibration for Future Council Members) will be posted to Snapshot voting on Thursday, 16th October.\n* Proposal B (Startup-Phase Bonus for Current Council Members) will follow at some point after Proposal A.\n\n## Voting Options\n\nThis proposal will include the following voting options:\n- For \n- Against \n- Abstain\n\nShould FOR be the majority preference, and the combined FOR and ABSTAIN votes meet at least 3% of the total votable ARB supply, the proposal will be considered approved and may proceed to implementation.",
      "type": "basic",
      "start": 1760616785,
      "state": "closed",
      "title": "AGV Council Compensation Calibration: Benchmark for Future Council Terms",
      "votes": 2332,
      "author": "0x4F685B29514eed0c9D929386E86D9cd81981118B",
      "quorum": 0,
      "scores": [
        156926091.987854,
        3442344.328218921,
        22756504.62249673
      ],
      "choices": [
        "For",
        "Against",
        "Abstain"
      ],
      "created": 1760616785,
      "scores_total": 183124940.93856966
    },
    {
      "id": "0xc5f06144fa92aaff99e0e44482ab6f7a3f6486dfb6c854d16271399ffcf895e6",
      "end": 1760628600,
      "body": "# Constitutional\n\n## Abstract\n\nThis AIP proposes to upgrade the on-chain voting system for the ArbitrumDAO’s governance contracts. The upgrade focuses on changing how the quorum threshold is computed such that it is a fixed percentage of the total Delegated Voting Power (DVP), impacting the quorum threshold for constitutional and non-constitutional proposals.\n\nThrough this temperature check, we aim to collect community sentiment on DVP Quorum. The exact parameters of the system will be confirmed through a separate Snapshot closer to the on-chain proposal. This will give the community more time to discuss the parameters and allow OCL to start working on the implementation in parallel.\n\n## Motivation & Rationale\n\nThe ArbitrumDAO has been struggling to achieve quorum on constitutional proposals. The gap between participation and quorum has been shrinking and has now become alarmingly low.If no tokens are excluded from voting, quorum currently increases at 36M ARB/year for non-constitutional proposals, and 54M ARB/year for constitutional proposals. It will soon reach a point where active voting power available is no longer greater than quorum, bringing the DAO to a standstill. This proposal aims to avoid such a scenario and provide a long term fix to ArbitrumDAO’s quorum issues.\n\nThe situation at hand is fueled by two fundamental issues. Firstly, quorum is computed based on the total voteable supply which has no relationship to the tokens registered to vote. Secondly, delegated voting power has remained relatively unchanged over time. Together, this has led to a scenario where the quorum threshold is increasing, but the total voting power is steady. This proposal focuses on addressing the first issue by redefining the quorum computation logic. Increasing DVP is a separate endeavour that should be pursued to further strengthen Arbitrum governance.\n\nKindly refer to this recently published [research report](https://forum.arbitrum.foundation/t/dvp-quorum-for-arbitrumdao/29996) and [Dune dashboard](https://dune.com/_amanwithwings/arb-dao-quorum) that explores the current situation in greater detail. The report supports moving to a DVP-based quorum model as it has several advantages including alignment with voter registration and not requiring token holders to actively exclude their votes from the votable supply. A DVP-based solution also preserves the fundamental properties of the existing voting system such as one token one vote and the ability for an external party to easily evaluate whether quorum has been reached.\n\n## Specifications\n\n### Proposed Quorum Model\n\nThis proposal seeks to replace the current voteable-supply-based quorum definition with a Delegated Voting Power (DVP)-based definition:\n\n`Quorum = max (ɑ*DVP, baseline quorum), where ɑ and baseline quorum are constants`\n* ɑ will have different values for non-constitutional and constitutional proposals\n* Similarly, baseline quorum will be different for non-constitutional and constitutional proposals\n\nThe formula ensures that quorum varies as a fixed percentage of DVP (ɑ*DVP), unless the baseline quorum is greater. The graph below shows how quorum would change with DVP if we choose an ɑ value of 0.5 and a baseline quorum of 150M ARB.\n\n![1](https://hackmd.io/_uploads/Hyea6Cmpxg.png)\n\n\nThis [research report](https://forum.arbitrum.foundation/t/dvp-quorum-for-arbitrumdao/29996) recommends choosing an ɑ value in the [0.4, 0.5] range with non-constitutional and constitutional quorum tending towards the lower and upper end of that range respectively. The report suggests 100M ARB as the baseline quorum value for non-constitutional proposals and 150M as the baseline quorum value for constitutional proposals. However, we will refrain from asking the DAO to vote on the exact quorum parameters at this stage. Parameters will be confirmed through a separate Snapshot closer to the on-chain proposal so that the community has more time to inform its decision.\n\nTo implement the proposed solution, the following smart-contract level changes need to be made:\n\n1. The $ARB token contract needs to be upgraded to keep a running total that is updated on each delegation change and token transfer.\n2. The DAO governor contracts need to be upgraded to use the new total DVP metric. Existing calculations need to be replaced with DVP-based thresholds.\n\nOffchain Labs will be taking on the development and testing of the proposed upgrades. An untested, unaudited PoC of the token contract upgrade can be found [here](https://github.com/ArbitrumFoundation/governance/compare/d13b123...c18ff53fbb).\n\n## Voting Options\n\nThrough this temperature check, we aim to collect community sentiment on DVP Quorum. The proposal will include the following voting options:\n\n* For DVP Quorum\n* Against DVP Quorum\n* Abstain\n\nShould *For DVP Quorum* be the majority preference, OCL will begin work on the implementation, including production-ready code and the necessary audits. The exact parameters of the DVP Quorum model (ɑ and baseline quorum values) will be determined through a separate Snapshot closer to the on-chain proposal.",
      "type": "single-choice",
      "start": 1760023800,
      "state": "closed",
      "title": "[Constitutional] AIP: DVP Quorum",
      "votes": 2147,
      "author": "0xb4c064f466931B8d0F637654c916E3F203c46f13",
      "quorum": 0,
      "scores": [
        157416575.1279309,
        16833522.675600387,
        71091.29452244808
      ],
      "choices": [
        "For DVP Quorum",
        "Against DVP Quorum",
        "Abstain"
      ],
      "created": 1760021312,
      "scores_total": 174321189.09805372
    }
  ],
  "topVoters": [
    {
      "address": "0xb4c064f466931B8d0F637654c916E3F203c46f13",
      "isWhale": false,
      "voteCount": 10,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 33490553.70912972,
      "participationRate": 0.001
    },
    {
      "address": "0xA5dF0cf3F95C6cd97d998b9D990a86864095d9b0",
      "isWhale": false,
      "voteCount": 5,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 16815225.768858176,
      "participationRate": 0.0005
    },
    {
      "address": "0x11cd09a0c5B1dc674615783b0772a9bFD53e3A8F",
      "isWhale": false,
      "voteCount": 10,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 15785237.237731315,
      "participationRate": 0.001
    },
    {
      "address": "0x1B686eE8E31c5959D9F5BBd8122a58682788eeaD",
      "isWhale": false,
      "voteCount": 10,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 15690969.260837838,
      "participationRate": 0.001
    },
    {
      "address": "0xdb5781a835b60110298fF7205D8ef9678Ff1f800",
      "isWhale": false,
      "voteCount": 3,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 14114350.357815448,
      "participationRate": 0.0003
    },
    {
      "address": "0x7a45eE0be5C4BdC938A5F00A2AEF393f46502D26",
      "isWhale": false,
      "voteCount": 1,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 13551757.059462955,
      "participationRate": 0.0001
    },
    {
      "address": "0xb5B069370Ef24BC67F114e185D185063CE3479f8",
      "isWhale": false,
      "voteCount": 8,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 13197454.574942991,
      "participationRate": 0.0008
    },
    {
      "address": "0x2e3BEf6830Ae84bb4225D318F9f61B6b88C147bF",
      "isWhale": false,
      "voteCount": 10,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 12953007.491421232,
      "participationRate": 0.001
    },
    {
      "address": "0xC7782d8bFBE4219A63Ed8773a7b67b1a9B645Cfa",
      "isWhale": false,
      "voteCount": 5,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 11974990.05,
      "participationRate": 0.0005
    },
    {
      "address": "0xB933AEe47C438f22DE0747D57fc239FE37878Dd1",
      "isWhale": false,
      "voteCount": 10,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 10832157.492167313,
      "participationRate": 0.001
    },
    {
      "address": "0x5663D01D8109DDFC8aACf09fBE51F2d341bb3643",
      "isWhale": false,
      "voteCount": 8,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 10795614.913859086,
      "participationRate": 0.0008
    },
    {
      "address": "0x2ef27b114917dD53f8633440A7C0328fef132e2F",
      "isWhale": false,
      "voteCount": 9,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 10392095.736076172,
      "participationRate": 0.0009
    },
    {
      "address": "0x839395e20bbB182fa440d08F850E6c7A8f6F0780",
      "isWhale": false,
      "voteCount": 10,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 9637729.535332091,
      "participationRate": 0.001
    },
    {
      "address": "0xF4B0556B9B6F53E00A1FDD2b0478Ce841991D8fA",
      "isWhale": false,
      "voteCount": 10,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 9357611.278859051,
      "participationRate": 0.001
    },
    {
      "address": "0x183D275AC4A046d549aD4dc89c41bff49D632Fa3",
      "isWhale": false,
      "voteCount": 10,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 8003033.109621432,
      "participationRate": 0.001
    },
    {
      "address": "0xAbAbE91A907fAdff921720C43ABe4098e7245E99",
      "isWhale": false,
      "voteCount": 8,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 7391824.864084769,
      "participationRate": 0.0008
    },
    {
      "address": "0xF92F185AbD9E00F56cb11B0b709029633d1E37B4",
      "isWhale": false,
      "voteCount": 4,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 7185462.40797796,
      "participationRate": 0.0004
    },
    {
      "address": "0x8F73bE66CA8c79382f72139be03746343Bf5Faa0",
      "isWhale": false,
      "voteCount": 8,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 6330595.151240317,
      "participationRate": 0.0008
    },
    {
      "address": "0xa6e8772af29b29B9202a073f8E36f447689BEef6",
      "isWhale": false,
      "voteCount": 7,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 5660239.457999401,
      "participationRate": 0.0007
    },
    {
      "address": "0x4fD86a688F36ADA5D6B7eb76BB88e570C9DEec86",
      "isWhale": false,
      "voteCount": 10,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 5201835.996102646,
      "participationRate": 0.001
    },
    {
      "address": "0x8b37a5Af68D315cf5A64097D96621F64b5502a22",
      "isWhale": false,
      "voteCount": 10,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 5195547.661516987,
      "participationRate": 0.001
    },
    {
      "address": "0xd333Bc5c9670C9cEb18f9A2CF02C6E86807a8227",
      "isWhale": false,
      "voteCount": 10,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 4710737.499894182,
      "participationRate": 0.001
    },
    {
      "address": "0x0eB5B03c0303f2F47cD81d7BE4275AF8Ed347576",
      "isWhale": false,
      "voteCount": 8,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 4219151.914495122,
      "participationRate": 0.0008
    },
    {
      "address": "0xb29A655f3D67B2B6724Fb22B2C2303cB660c946B",
      "isWhale": false,
      "voteCount": 10,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 3321885.6452301666,
      "participationRate": 0.001
    },
    {
      "address": "0x79C4213a328E3B4F1D87b4953C14759399dB25E2",
      "isWhale": false,
      "voteCount": 2,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 3157516.4508757386,
      "participationRate": 0.0002
    },
    {
      "address": "0x3070FeEAfD678751c29171Bacd0042Fb370DEE00",
      "isWhale": false,
      "voteCount": 2,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 3094087.7156064976,
      "participationRate": 0.0002
    },
    {
      "address": "0xa9e777D56C0Ad861f6a03967E080e767ad8D39b6",
      "isWhale": false,
      "voteCount": 7,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 2978843.3630409655,
      "participationRate": 0.0007
    },
    {
      "address": "0x4F685B29514eed0c9D929386E86D9cd81981118B",
      "isWhale": false,
      "voteCount": 10,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 2550449.5826758584,
      "participationRate": 0.001
    },
    {
      "address": "0xBA875DED061896896654f87E3B0bb908232cd4ea",
      "isWhale": false,
      "voteCount": 4,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 2372514.823479759,
      "participationRate": 0.0004
    },
    {
      "address": "0x583E3EDc26E1B8620341bce90547197bfE2c1ddD",
      "isWhale": false,
      "voteCount": 10,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 2172921.661350329,
      "participationRate": 0.001
    },
    {
      "address": "0x8326D18edfC50B4335113C33b25116ec268FF3fE",
      "isWhale": false,
      "voteCount": 10,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 1327061.083907024,
      "participationRate": 0.001
    },
    {
      "address": "0x7B0befc5B043148Cd7bD5cFeEEf7BC63D28edEC0",
      "isWhale": false,
      "voteCount": 10,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 1304410.0086997952,
      "participationRate": 0.001
    },
    {
      "address": "0x714D8b5874b3a6a69f289f4e857F4C9670074296",
      "isWhale": false,
      "voteCount": 6,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 750319.2344713941,
      "participationRate": 0.0006
    },
    {
      "address": "0x539629494be6b004d33d290E6243806750A3A2f4",
      "isWhale": false,
      "voteCount": 9,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 733815.2913605983,
      "participationRate": 0.0009
    },
    {
      "address": "0xE594469fDe6AE29943a64f81d95c20F5F8eB2e04",
      "isWhale": false,
      "voteCount": 10,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 703527.2960788487,
      "participationRate": 0.001
    },
    {
      "address": "0xb35659cbac913D5E4119F2Af47fD490A45e2c826",
      "isWhale": false,
      "voteCount": 9,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 646648.1463847709,
      "participationRate": 0.0009
    },
    {
      "address": "0xeB13FD078AB234737cC8621Be00F007cA35bB3c3",
      "isWhale": false,
      "voteCount": 2,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 580317.2282787252,
      "participationRate": 0.0002
    },
    {
      "address": "0xfA0142fEBf46e3F1E33a1c03922c365f882725Ca",
      "isWhale": false,
      "voteCount": 10,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 548103.9669721714,
      "participationRate": 0.001
    },
    {
      "address": "0xaE79f0562C2128cC12d0ac068aC288856Fe0e1AB",
      "isWhale": false,
      "voteCount": 4,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 530447.5189183564,
      "participationRate": 0.0004
    },
    {
      "address": "0x010DC5440ad49f9Ec0Dd325b622d9FD225944ee4",
      "isWhale": false,
      "voteCount": 9,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 527404.5305883654,
      "participationRate": 0.0009
    },
    {
      "address": "0x7AE109A63ff4DC852e063a673b40BED85D22E585",
      "isWhale": false,
      "voteCount": 6,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 502794.27863111044,
      "participationRate": 0.0006
    },
    {
      "address": "0x98033EFB9125333f4F6353BcC5e2D0Ae06b436a2",
      "isWhale": false,
      "voteCount": 1,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 500000.00000055454,
      "participationRate": 0.0001
    },
    {
      "address": "0xA7860E99e3ce0752D1ac53b974E309fFf80277C6",
      "isWhale": false,
      "voteCount": 1,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 478291.18902519054,
      "participationRate": 0.0001
    },
    {
      "address": "0x13BDaE8c5F0fC40231F0E6A4ad70196F59138548",
      "isWhale": false,
      "voteCount": 2,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 451020.7791094907,
      "participationRate": 0.0002
    },
    {
      "address": "0x3D1846ea60001A3Bc21438d76f3958422fe89adB",
      "isWhale": false,
      "voteCount": 1,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 350445.5116960779,
      "participationRate": 0.0001
    },
    {
      "address": "0x3EF1b0db4D10d2e3cE06699C0BD4EF0aAf897614",
      "isWhale": false,
      "voteCount": 10,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 235555.84789543442,
      "participationRate": 0.001
    },
    {
      "address": "0x6f9BB7e454f5B3eb2310343f0E99269dC2BB8A1d",
      "isWhale": false,
      "voteCount": 10,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 208703.5976874644,
      "participationRate": 0.001
    },
    {
      "address": "0xE93D59CC0bcECFD4ac204827eF67c5266079E2b5",
      "isWhale": false,
      "voteCount": 9,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 203628.17006439975,
      "participationRate": 0.0009
    },
    {
      "address": "0x2D7d6Ec6198ADFD5850D00BD601958F6E316b05E",
      "isWhale": false,
      "voteCount": 10,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 200150.7516537031,
      "participationRate": 0.001
    },
    {
      "address": "0x5162728cc4D7D111400056925A1b3DF82308bEE0",
      "isWhale": false,
      "voteCount": 10,
      "isDelegate": false,
      "delegatedPower": 0,
      "directTokenPower": 0,
      "totalVotingPower": 178530.28051938073,
      "participationRate": 0.001
    }
  ],
  "proposalAnalyses": [
    {
      "id": "0xa06500740b56c647f25bd3edba80bf05b00140afe99d6b0d27c0f1dc93287901",
      "title": "Rewarding Active Delegates (RAD) Program",
      "outcome": "For",
      "topVoters": [
        {
          "address": "0xb4c064f466931B8d0F637654c916E3F203c46f13",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 33490553.70912972,
          "participationRate": 0.001
        },
        {
          "address": "0xA5dF0cf3F95C6cd97d998b9D990a86864095d9b0",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 16815225.768858176,
          "participationRate": 0.001
        },
        {
          "address": "0x11cd09a0c5B1dc674615783b0772a9bFD53e3A8F",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 14859010.693228187,
          "participationRate": 0.001
        },
        {
          "address": "0xdb5781a835b60110298fF7205D8ef9678Ff1f800",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 14114350.357815448,
          "participationRate": 0.001
        },
        {
          "address": "0xb5B069370Ef24BC67F114e185D185063CE3479f8",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 13197454.574942991,
          "participationRate": 0.001
        },
        {
          "address": "0x2e3BEf6830Ae84bb4225D318F9f61B6b88C147bF",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 12953007.491421232,
          "participationRate": 0.001
        },
        {
          "address": "0xC7782d8bFBE4219A63Ed8773a7b67b1a9B645Cfa",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 11974990.05,
          "participationRate": 0.001
        },
        {
          "address": "0x2ef27b114917dD53f8633440A7C0328fef132e2F",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 10324880.891529191,
          "participationRate": 0.001
        },
        {
          "address": "0xB933AEe47C438f22DE0747D57fc239FE37878Dd1",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 10197124.274333972,
          "participationRate": 0.001
        },
        {
          "address": "0x5663D01D8109DDFC8aACf09fBE51F2d341bb3643",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 10160645.955525754,
          "participationRate": 0.001
        }
      ],
      "totalVotes": 2554,
      "totalVotingPower": 232376999.01792055,
      "turnoutPercentage": 0
    },
    {
      "id": "0x12bad84219d04c54cd72231ad8fe883499e85c14762919a06aaa7a251d64b8da",
      "title": "AGV - 2026 Council Elections",
      "outcome": "David Bolger",
      "topVoters": [
        {
          "address": "0xb4c064f466931B8d0F637654c916E3F203c46f13",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 24046492.531334132,
          "participationRate": 0.001
        },
        {
          "address": "0x11cd09a0c5B1dc674615783b0772a9bFD53e3A8F",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 14858898.087586334,
          "participationRate": 0.001
        },
        {
          "address": "0xA5dF0cf3F95C6cd97d998b9D990a86864095d9b0",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 10815257.169538788,
          "participationRate": 0.001
        },
        {
          "address": "0x2ef27b114917dD53f8633440A7C0328fef132e2F",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 10324711.191027606,
          "participationRate": 0.001
        },
        {
          "address": "0xb5B069370Ef24BC67F114e185D185063CE3479f8",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 10197245.802908963,
          "participationRate": 0.001
        },
        {
          "address": "0xB933AEe47C438f22DE0747D57fc239FE37878Dd1",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 10197124.274333972,
          "participationRate": 0.001
        },
        {
          "address": "0x5663D01D8109DDFC8aACf09fBE51F2d341bb3643",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 10160645.955525754,
          "participationRate": 0.001
        },
        {
          "address": "0x1B686eE8E31c5959D9F5BBd8122a58682788eeaD",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 9675929.063274637,
          "participationRate": 0.001
        },
        {
          "address": "0xF4B0556B9B6F53E00A1FDD2b0478Ce841991D8fA",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 8966745.012177544,
          "participationRate": 0.001
        },
        {
          "address": "0x2e3BEf6830Ae84bb4225D318F9f61B6b88C147bF",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 8932710.440815868,
          "participationRate": 0.001
        }
      ],
      "totalVotes": 1691,
      "totalVotingPower": 184301062.31638572,
      "turnoutPercentage": 0
    },
    {
      "id": "0x0a3a7b84c7c01cc0feb8a7fad662cbf1f5aeb1b089b205ce412e2bc01d99c504",
      "title": "John Kennedy reconfirmation for AGV council",
      "outcome": "For",
      "topVoters": [
        {
          "address": "0xb4c064f466931B8d0F637654c916E3F203c46f13",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 24046465.400502004,
          "participationRate": 0.001
        },
        {
          "address": "0x11cd09a0c5B1dc674615783b0772a9bFD53e3A8F",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 14859137.118585521,
          "participationRate": 0.001
        },
        {
          "address": "0x2ef27b114917dD53f8633440A7C0328fef132e2F",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 10324757.446805185,
          "participationRate": 0.001
        },
        {
          "address": "0xb5B069370Ef24BC67F114e185D185063CE3479f8",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 10201304.205620369,
          "participationRate": 0.001
        },
        {
          "address": "0xB933AEe47C438f22DE0747D57fc239FE37878Dd1",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 10197198.369063789,
          "participationRate": 0.001
        },
        {
          "address": "0x5663D01D8109DDFC8aACf09fBE51F2d341bb3643",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 10160645.955525754,
          "participationRate": 0.001
        },
        {
          "address": "0x1B686eE8E31c5959D9F5BBd8122a58682788eeaD",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 9659316.620079912,
          "participationRate": 0.001
        },
        {
          "address": "0xdb5781a835b60110298fF7205D8ef9678Ff1f800",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 9314347.536576468,
          "participationRate": 0.001
        },
        {
          "address": "0xF4B0556B9B6F53E00A1FDD2b0478Ce841991D8fA",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 8988495.049756737,
          "participationRate": 0.001
        },
        {
          "address": "0x2e3BEf6830Ae84bb4225D318F9f61B6b88C147bF",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 8944058.594531605,
          "participationRate": 0.001
        }
      ],
      "totalVotes": 1903,
      "totalVotingPower": 186883147.87124765,
      "turnoutPercentage": 0
    },
    {
      "id": "0x2253b8cdf0d483adf4dd1e9c4a9f473184a51a0ee3e8e826371c203f376edbc6",
      "title": "Tim Chang reconfirmation for AGV council",
      "outcome": "For",
      "topVoters": [
        {
          "address": "0xb4c064f466931B8d0F637654c916E3F203c46f13",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 24046465.400502004,
          "participationRate": 0.001
        },
        {
          "address": "0x11cd09a0c5B1dc674615783b0772a9bFD53e3A8F",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 14859137.118585521,
          "participationRate": 0.001
        },
        {
          "address": "0x2ef27b114917dD53f8633440A7C0328fef132e2F",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 10324757.446805185,
          "participationRate": 0.001
        },
        {
          "address": "0xb5B069370Ef24BC67F114e185D185063CE3479f8",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 10201304.205620369,
          "participationRate": 0.001
        },
        {
          "address": "0xB933AEe47C438f22DE0747D57fc239FE37878Dd1",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 10197198.369063789,
          "participationRate": 0.001
        },
        {
          "address": "0x1B686eE8E31c5959D9F5BBd8122a58682788eeaD",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 9659316.620079912,
          "participationRate": 0.001
        },
        {
          "address": "0xdb5781a835b60110298fF7205D8ef9678Ff1f800",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 9314347.536576468,
          "participationRate": 0.001
        },
        {
          "address": "0xF4B0556B9B6F53E00A1FDD2b0478Ce841991D8fA",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 8988495.049756737,
          "participationRate": 0.001
        },
        {
          "address": "0x2e3BEf6830Ae84bb4225D318F9f61B6b88C147bF",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 8944058.594531605,
          "participationRate": 0.001
        },
        {
          "address": "0x183D275AC4A046d549aD4dc89c41bff49D632Fa3",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 8002919.28407709,
          "participationRate": 0.001
        }
      ],
      "totalVotes": 1903,
      "totalVotingPower": 176721209.9087112,
      "turnoutPercentage": 0
    },
    {
      "id": "0x4a96a91d162975de0d402b83ca8b8a24e808ca357150120fc0d44ae0bf1cc4a5",
      "title": "AIP: Raise the gas target, min L2 base fee, & implement improvements to the pricing algorithm",
      "outcome": "For",
      "topVoters": [
        {
          "address": "0xb4c064f466931B8d0F637654c916E3F203c46f13",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 24368647.911237683,
          "participationRate": 0.001
        },
        {
          "address": "0x11cd09a0c5B1dc674615783b0772a9bFD53e3A8F",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 15785237.237731315,
          "participationRate": 0.001
        },
        {
          "address": "0xB933AEe47C438f22DE0747D57fc239FE37878Dd1",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 10832157.492167313,
          "participationRate": 0.001
        },
        {
          "address": "0x5663D01D8109DDFC8aACf09fBE51F2d341bb3643",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 10795614.913859086,
          "participationRate": 0.001
        },
        {
          "address": "0x1B686eE8E31c5959D9F5BBd8122a58682788eeaD",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 9625846.107398966,
          "participationRate": 0.001
        },
        {
          "address": "0xF4B0556B9B6F53E00A1FDD2b0478Ce841991D8fA",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 9205005.244667962,
          "participationRate": 0.001
        },
        {
          "address": "0x2e3BEf6830Ae84bb4225D318F9f61B6b88C147bF",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 8947435.227785679,
          "participationRate": 0.001
        },
        {
          "address": "0x183D275AC4A046d549aD4dc89c41bff49D632Fa3",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 8003033.109621432,
          "participationRate": 0.001
        },
        {
          "address": "0x4fD86a688F36ADA5D6B7eb76BB88e570C9DEec86",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 5201835.996102646,
          "participationRate": 0.001
        },
        {
          "address": "0x8b37a5Af68D315cf5A64097D96621F64b5502a22",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 5195547.661516987,
          "participationRate": 0.001
        }
      ],
      "totalVotes": 2073,
      "totalVotingPower": 137278150.16852942,
      "turnoutPercentage": 0
    },
    {
      "id": "0x23702e34d0ffdabe6e17315f81daaf4119a36d108326473a6e063a35da5ba281",
      "title": "AGV Council Compensation Calibration: Startup-Phase Bonus for Current Council Members",
      "outcome": "For",
      "topVoters": [
        {
          "address": "0xb4c064f466931B8d0F637654c916E3F203c46f13",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 24323726.188286975,
          "participationRate": 0.001
        },
        {
          "address": "0x11cd09a0c5B1dc674615783b0772a9bFD53e3A8F",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 15784853.596643126,
          "participationRate": 0.001
        },
        {
          "address": "0xB933AEe47C438f22DE0747D57fc239FE37878Dd1",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 10828828.131248582,
          "participationRate": 0.001
        },
        {
          "address": "0x2ef27b114917dD53f8633440A7C0328fef132e2F",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 10324089.104988307,
          "participationRate": 0.001
        },
        {
          "address": "0xb5B069370Ef24BC67F114e185D185063CE3479f8",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 10201863.500919353,
          "participationRate": 0.001
        },
        {
          "address": "0x1B686eE8E31c5959D9F5BBd8122a58682788eeaD",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 9629722.564390967,
          "participationRate": 0.001
        },
        {
          "address": "0xF4B0556B9B6F53E00A1FDD2b0478Ce841991D8fA",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 9226466.617720753,
          "participationRate": 0.001
        },
        {
          "address": "0x2e3BEf6830Ae84bb4225D318F9f61B6b88C147bF",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 8949542.611755172,
          "participationRate": 0.001
        },
        {
          "address": "0x183D275AC4A046d549aD4dc89c41bff49D632Fa3",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 8002997.518767931,
          "participationRate": 0.001
        },
        {
          "address": "0xF92F185AbD9E00F56cb11B0b709029633d1E37B4",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 7185462.40797796,
          "participationRate": 0.001
        }
      ],
      "totalVotes": 2154,
      "totalVotingPower": 165579065.62635612,
      "turnoutPercentage": 0
    },
    {
      "id": "0x44dedacbdae958904427db9ee93065917f57f50b71b4e87a94a318de18df399b",
      "title": "The DAO Incentive Program (DIP 2.0)",
      "outcome": "Against",
      "topVoters": [
        {
          "address": "0xb4c064f466931B8d0F637654c916E3F203c46f13",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 24319126.73181619,
          "participationRate": 0.001
        },
        {
          "address": "0x11cd09a0c5B1dc674615783b0772a9bFD53e3A8F",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 15785188.62843369,
          "participationRate": 0.001
        },
        {
          "address": "0x7a45eE0be5C4BdC938A5F00A2AEF393f46502D26",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 13551757.059462955,
          "participationRate": 0.001
        },
        {
          "address": "0xB933AEe47C438f22DE0747D57fc239FE37878Dd1",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 10832100.242923403,
          "participationRate": 0.001
        },
        {
          "address": "0x5663D01D8109DDFC8aACf09fBE51F2d341bb3643",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 10795614.913859086,
          "participationRate": 0.001
        },
        {
          "address": "0x2ef27b114917dD53f8633440A7C0328fef132e2F",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 10326756.485966763,
          "participationRate": 0.001
        },
        {
          "address": "0xb5B069370Ef24BC67F114e185D185063CE3479f8",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 10187238.55987105,
          "participationRate": 0.001
        },
        {
          "address": "0x1B686eE8E31c5959D9F5BBd8122a58682788eeaD",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 9676521.272630379,
          "participationRate": 0.001
        },
        {
          "address": "0xF4B0556B9B6F53E00A1FDD2b0478Ce841991D8fA",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 9135245.232246991,
          "participationRate": 0.001
        },
        {
          "address": "0x2e3BEf6830Ae84bb4225D318F9f61B6b88C147bF",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 8964908.656659491,
          "participationRate": 0.001
        }
      ],
      "totalVotes": 2076,
      "totalVotingPower": 183452042.43065897,
      "turnoutPercentage": 0
    },
    {
      "id": "0xb9e775ba4f1fa8cdc8e45c342428c3dabff7f19ce7b8cc4bde7cc6c8e542d963",
      "title": "[Temperature Check] Should we try a Delegate Incentive Program like the Arbitrum Triple Dip?",
      "outcome": "Against",
      "topVoters": [
        {
          "address": "0xb4c064f466931B8d0F637654c916E3F203c46f13",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 23455778.92695154,
          "participationRate": 0.001
        },
        {
          "address": "0x1B686eE8E31c5959D9F5BBd8122a58682788eeaD",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 15690969.260837838,
          "participationRate": 0.001
        },
        {
          "address": "0x11cd09a0c5B1dc674615783b0772a9bFD53e3A8F",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 12989964.09093369,
          "participationRate": 0.001
        },
        {
          "address": "0xA5dF0cf3F95C6cd97d998b9D990a86864095d9b0",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 10824336.041611113,
          "participationRate": 0.001
        },
        {
          "address": "0x2ef27b114917dD53f8633440A7C0328fef132e2F",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 10327264.101159237,
          "participationRate": 0.001
        },
        {
          "address": "0x2e3BEf6830Ae84bb4225D318F9f61B6b88C147bF",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 9795374.949654255,
          "participationRate": 0.001
        },
        {
          "address": "0xF4B0556B9B6F53E00A1FDD2b0478Ce841991D8fA",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 9204166.563722458,
          "participationRate": 0.001
        },
        {
          "address": "0xB933AEe47C438f22DE0747D57fc239FE37878Dd1",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 8726477.326256735,
          "participationRate": 0.001
        },
        {
          "address": "0x5663D01D8109DDFC8aACf09fBE51F2d341bb3643",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 8689991.99719242,
          "participationRate": 0.001
        },
        {
          "address": "0x183D275AC4A046d549aD4dc89c41bff49D632Fa3",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 8002919.28407709,
          "participationRate": 0.001
        }
      ],
      "totalVotes": 2416,
      "totalVotingPower": 164691971.4498732,
      "turnoutPercentage": 0
    },
    {
      "id": "0xdfdf56e53e2a77968c2c124be9210a5f33cb2261cca00e1d6b04f8bb6dfa626d",
      "title": "AGV Council Compensation Calibration: Benchmark for Future Council Terms",
      "outcome": "For",
      "topVoters": [
        {
          "address": "0xb4c064f466931B8d0F637654c916E3F203c46f13",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 23455778.92695154,
          "participationRate": 0.001
        },
        {
          "address": "0x1B686eE8E31c5959D9F5BBd8122a58682788eeaD",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 15690906.592185099,
          "participationRate": 0.001
        },
        {
          "address": "0x11cd09a0c5B1dc674615783b0772a9bFD53e3A8F",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 12989964.09093369,
          "participationRate": 0.001
        },
        {
          "address": "0xA5dF0cf3F95C6cd97d998b9D990a86864095d9b0",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 10848776.654824622,
          "participationRate": 0.001
        },
        {
          "address": "0x2ef27b114917dD53f8633440A7C0328fef132e2F",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 10327264.101159237,
          "participationRate": 0.001
        },
        {
          "address": "0x2e3BEf6830Ae84bb4225D318F9f61B6b88C147bF",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 9795404.327736119,
          "participationRate": 0.001
        },
        {
          "address": "0xF4B0556B9B6F53E00A1FDD2b0478Ce841991D8fA",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 9205912.758844882,
          "participationRate": 0.001
        },
        {
          "address": "0xB933AEe47C438f22DE0747D57fc239FE37878Dd1",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 8726477.326256735,
          "participationRate": 0.001
        },
        {
          "address": "0x5663D01D8109DDFC8aACf09fBE51F2d341bb3643",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 8689991.99719242,
          "participationRate": 0.001
        },
        {
          "address": "0x183D275AC4A046d549aD4dc89c41bff49D632Fa3",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 8002919.28407709,
          "participationRate": 0.001
        }
      ],
      "totalVotes": 2332,
      "totalVotingPower": 183124940.93856966,
      "turnoutPercentage": 0
    },
    {
      "id": "0xc5f06144fa92aaff99e0e44482ab6f7a3f6486dfb6c854d16271399ffcf895e6",
      "title": "[Constitutional] AIP: DVP Quorum",
      "outcome": "For DVP Quorum",
      "topVoters": [
        {
          "address": "0xb4c064f466931B8d0F637654c916E3F203c46f13",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 23804245.36373682,
          "participationRate": 0.001
        },
        {
          "address": "0x1B686eE8E31c5959D9F5BBd8122a58682788eeaD",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 15646885.746031158,
          "participationRate": 0.001
        },
        {
          "address": "0x11cd09a0c5B1dc674615783b0772a9bFD53e3A8F",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 12987106.809237951,
          "participationRate": 0.001
        },
        {
          "address": "0xA5dF0cf3F95C6cd97d998b9D990a86864095d9b0",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 10833958.751258938,
          "participationRate": 0.001
        },
        {
          "address": "0x2ef27b114917dD53f8633440A7C0328fef132e2F",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 10392095.736076172,
          "participationRate": 0.001
        },
        {
          "address": "0x2e3BEf6830Ae84bb4225D318F9f61B6b88C147bF",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 9682441.00332675,
          "participationRate": 0.001
        },
        {
          "address": "0xF4B0556B9B6F53E00A1FDD2b0478Ce841991D8fA",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 9357611.278859051,
          "participationRate": 0.001
        },
        {
          "address": "0xB933AEe47C438f22DE0747D57fc239FE37878Dd1",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 8725462.465324929,
          "participationRate": 0.001
        },
        {
          "address": "0x5663D01D8109DDFC8aACf09fBE51F2d341bb3643",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 8689991.99719242,
          "participationRate": 0.001
        },
        {
          "address": "0x183D275AC4A046d549aD4dc89c41bff49D632Fa3",
          "isWhale": false,
          "voteCount": 1,
          "isDelegate": false,
          "delegatedPower": 0,
          "directTokenPower": 0,
          "totalVotingPower": 8002919.28407709,
          "participationRate": 0.001
        }
      ],
      "totalVotes": 2147,
      "totalVotingPower": 174321189.09805372,
      "turnoutPercentage": 0
    }
  ],
  "powerDistribution": {
    "uniqueVoters": 2012,
    "top1Percentage": 11.71861473803434,
    "top5Percentage": 33.55490118352772,
    "giniCoefficient": 0.9884431495311448,
    "top10Percentage": 55.42743252065705,
    "top20Percentage": 83.40469636647862,
    "totalVotingPower": 285789356.99995005,
    "nakamotoCoefficient": 9
  }
}